
local AuctionIndex = AuctionIndex or {}
--一级标题
AuctionIndex.mainIndex = 
{
	[0] = "全部",
 	[1] = "神器",
 	[2] = "材料",
 	[3] = "寶石",
 	[4] = "馬具",--拍卖行没配,没有坐骑相关道具可交易
 	[5] = "成長",
 	[6] = "藥品",
 	[7] = "其他",
}
--二级标题
AuctionIndex.secondIndex = 
{
	[0] = "無",
 	[1] = "兵器",
 	[2] = "鎧甲",
 	[3] = "洗煉",
 	[4] = "煉星",
 	[5] = "預留5",
 	[6] = "預留6",
 	[7] = "預留7",
 	[8] = "預留8",
 	[9] = "圓形",
 	[10] = "三角形",
 	[11] = "方形",
 	[12] = "半月形",
 	[13] = "卷軸",	--现在只有新手马,不能卖,拍卖行没配
 	[14] = "馬草",--拍卖行没配
 	[15] = "馬鞭",	--拍卖行没配
 	[16] = "馬鎧",	--拍卖行没配
 	[17] = "馬轡",	--拍卖行没配
 	[18] = "馬鞍",	--拍卖行没配
 	[19] = "馬鐙",	--拍卖行没配
 	[20] = "馬掌",	--拍卖行没配
 	[21] = "封魔帖",
 	[22] = "押鏢令",
 	[23] = "豪傑酒",
 	[24] = "預留24",
 	[25] = "預留25",
 	[26] = "恢復",
 	[27] = "經驗",
 	[28] = "刀",
 	[29] = "槍",
 	[30] = "杖",
 	[31] = "弓",
  	[35] = "錘",	
  	[36] = "扇",	
  	[37] = "盾",	
}
--三级标题(暂无)
AuctionIndex.thirdIndex = 
{
	[0] = "無",
}

--[[
一级标题和二级标题对应关系
]]
AuctionIndex.AuctionIndexMap = {
	main = {0,1,4,5,7},
	[0] = {},
	[1] = {28,29,30,31,35,36,37,2},
	[4] = {15,16,17,18,19,20},
	[5] = {21,22,23},
	[7] = {},
}

--UIPopupList
AuctionIndex.popupList = {

	{name="30級",min=30,max=39,},
	{name="40級",min=40,max=49,},
	{name="50級",min=50,max=59,},
	{name="60級",min=60,max=69,},
	{name="70級",min=70,max=74,},
	{name="75級",min=75,max=79,},
	{name="80級",min=80,max=84,},
	{name="85級",min=85,max=89,},
	{name="90級",min=90,max=94,},
	{name="95級",min=95,max=99,},
	{name="100級",min=100,max=100,},
	{name="全部等級",min=0,max=0,},
}

return AuctionIndex