--活跃奖励
local vitality_reward = 
{ --type：领奖类型 1.月活跃 2.日活跃
	--month：月份
	--[活跃数值] = 奖励模版ID
    Month1Activity = {data = {month = 1, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month2Activity = {data = {month = 2, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month3Activity = { data = {month = 3, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month4Activity = {data = {month = 4, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month5Activity = { data = {month = 5, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month6Activity = { data = {month = 6, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month7Activity = {data = {month = 7, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month8Activity = {data = {month = 8, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month9Activity = {data = {month = 9, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month10Activity = {data = {month = 10, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month11Activity = {data = {month = 11, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    Month12Activity = {data = {month = 12, node = {[150] = 131, [450] = 132, [900] = 133, [1500] = 134, [2200] = 135}}},
    dayActivity = 
	{
	   num = {4, 8, 12},
	   data = 
	    {
	       [20] = 125, [40] = 126, [60] = 127, [100] = 128, 
		   [120] = 129, [140] = 130, [160] = 131, [200] = 132,
		   [220] = 133, [240] = 134, [260] = 135, [300] = 136,
		},
	},
}

--计时奖励
local online_reward =
{
    -- 在线发奖,累计计时
    [1] = { {time = 180, rewards = 110},
            {time = 600, rewards = 111},
            {time = 1800, rewards = 112},
            {time = 3600, rewards = 113},
            {time = 5400, rewards = 114},
            {time = 7200, rewards = 115} },

    -- 开服奖励,倒计时
    [2] = { {time = 300, rewards = 116},
            {time = 600, rewards = 117},
            {time = 900, rewards = 118},
            {time = 1800, rewards = 119},
            {time = 1800, rewards = 120},
            {time = 3600, rewards = 121} }
}

--签到奖励
local checkin_reward =
{
    --[第几天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    [1] = {235},
    [2] = {236},
    [3] = {237},
    [4] = {238},
    [5] = {239},
    [6] = {240},
    [7] = {241},
    [8] = {242},
}

--QQ会员签到额外奖励
local checkin_qqvip_reward =
{
    --[第几天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    [1] = {2430},
    [2] = {2431},
    [3] = {2432},
    [4] = {2433},
    [5] = {2434},
    [6] = {2435},
    [7] = {2436},
}

--超级QQ会员签到额外奖励
local checkin_qqsupervip_reward =
{
    --[第几天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    [1] = {2437},
    [2] = {2438},
    [3] = {2439},
    [4] = {2440},
    [5] = {2441},
    [6] = {2442},
    [7] = {2443},
}

--QQ游戏中心签到额外奖励
local checkin_qqgamecenter_reward =
{
    --[第几天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    [1] = {2471},
    [2] = {2471},
    [3] = {2471},
    [4] = {2471},
    [5] = {2471},
    [6] = {2471},
    [7] = {2471},
}

--微信游戏中心签到额外奖励
local checkin_wxgamecenter_reward =
{
    --[第几天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    [1] = {2471},
    [2] = {2471},
    [3] = {2471},
    [4] = {2471},
    [5] = {2471},
    [6] = {2471},
    [7] = {2471},
}

--开服大奖
local openday_reward =
{
    --[天] = {奖励模版ID,图片PathID}
    --天数可拓展
    [1] = {1238,1846},
    [2] = {1239,1847},
    [3] = {1240,1848},
    [4] = {1241,1849},
    [5] = {1242,1850},
    [6] = {1243,1851},
    [7] = {1244,1852},
    [8] = {1429,1853},
    [9] = {1430,1854},
    [10] = {1431,1855},
    [11] = {1432,1856},
    [12] = {1433,1857},
    [13] = {1434,1858},
    [14] = {1435,1845},
}

 --账号首充1
local topup_firsttime =
{
    --[天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --天数可拓展
    [9] = 
    {
        [1] = {1,1282,1276},
        -- ...
    },
}



 --每日充值
local topup_day =
{
    --[天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --天数可拓展
    [13] = 
    {
        [1] = {100,1297,1277},
        [2] = {300,1298,1277},
        [3] = {1000,1299,1277},
        [4] = {1580,1300,1277},
        [5] = {2880,1301,1277},
        -- ...
    },
    [14] = 
    {
        [1] = {100,1302,1278},
        [2] = {300,1303,1278},
        [3] = {1000,1304,1278},
        [4] = {1580,1305,1278},
        [5] = {2880,1306,1278},
        [6] = {5880,2370,1278},
        [7] = {9880,2371,1278},
        [8] = {19880,2375,1278},
        [9] = {29880,2376,1278},
        [10] = {49880,2377,1278},
        [11] = {69880,5834,1278},
        [12] = {99880,5835,1278},

	},
    [15] = 
    {
        [1] = {100,1302,1279},
        [2] = {300,1303,1279},
        [3] = {1000,1304,1279},
        [4] = {1580,1305,1279},
        [5] = {2880,1306,1279},
        [6] = {5880,2370,1279},
        [7] = {9880,2371,1279},
        [8] = {19880,2375,1279},
        [9] = {29880,2376,1279},
        [10] = {49880,2377,1279},
        [11] = {69880,5834,1279},
        [12] = {99880,5835,1279},
	},
    [16] = 
    {
        [1] = {100,1451,1280},
        [2] = {300,1452,1280},
        [3] = {1000,1453,1280},
        [4] = {1580,1454,1280},
        [5] = {2880,1455,1280},
	},
}

 --终生返还
local lifetimereward =
{
    --[天] = {每日返还奖励模版ID, 活动ID,消耗钻石数,一次性奖励模板ID}
    --天数可拓展
    [94] = 
    {
        [1] = {4818,4677,2016,4817},
    },
}

 --成长基金时间版
local growthcapital_day =
{
    --[天] = {第X天,奖励模版ID1, 活动ID,消耗钻石数,一次性奖励模板ID,共计获得钻石数}
    --天数可拓展
    [18] = 
    {
        [1] = {1,1358,1275,2880,1357,8888},
        [2] = {2,1358,1275,2880,1357,8888},
        [3] = {3,1358,1275,2880,1357,8888},
        [4] = {4,1358,1275,2880,1357,8888},
        [5] = {5,1358,1275,2880,1357,8888},
        [6] = {6,1358,1275,2880,1357,8888},
        [7] = {7,1358,1275,2880,1357,8888},
        [8] = {8,1358,1275,2880,1357,8888},
        [9] = {9,1358,1275,2880,1357,8888},
        [10] = {10,1358,1275,2880,1357,8888},
        [11] = {11,1358,1275,2880,1357,8888},
        [12] = {12,1358,1275,2880,1357,8888},
        [13] = {13,1358,1275,2880,1357,8888},
        [14] = {14,1358,1275,2880,1357,8888},
        [15] = {15,1358,1275,2880,1357,8888},
    },
}

 --成长基金等级版
local growthcapital_level =
{
    --[天] = {等级,奖励模版ID1, 活动ID,消耗钻石数,一次性奖励模板ID,共计获得钻石数}
    --天数可拓展
    [21] = 
    {
        [1] = {10,1368,1274,5980,1367,16888},
        [2] = {20,1369,1274,5980,1367,16888},
        [3] = {30,1370,1274,5980,1367,16888},
        [4] = {40,1371,1274,5980,1367,16888},
        [5] = {50,1372,1274,5980,1367,16888},
        [6] = {60,1373,1274,5980,1367,16888},
        [7] = {70,1374,1274,5980,1367,16888},
        -- ...
    },
}


 --累积充值 20260910台服翻译用注释修改
local topup_period =
{
    --[天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --天数可拓展
    [26] = 
    {
        [1] = {80,1307,1378},
        [2] = {480,1308,1378},
        [3] = {1080,1309,1378},
        [4] = {2580,1310,1378},
        [5] = {3980,1311,1378},
        [6] = {9880,1312,1378},
        [7] = {15880,1313,1378},
        [8] = {35880,1314,1378},
        [9] = {68880,1315,1378},
        [10] = {128880,1316,1378},
        [11] = {188880,1317,1378},
        [12] = {288880,2378,1378},
        [13] = {388880,2379,1378},
        [14] = {588880,5836,1378},
        -- ...
    },
    [25] = 
    {
        [1] = {80,1307,1281},
        [2] = {480,1308,1281},
        [3] = {1080,1309,1281},
        [4] = {2580,1310,1281},
        [5] = {3980,1311,1281},
        [6] = {9880,1312,1281},
        [7] = {15880,1313,1281},
        [8] = {35880,1314,1281},
        [9] = {68880,1315,1281},
        [10] = {128880,1316,1281},
        [11] = {188880,1317,1281},
        [12] = {288880,2378,1281},
        [13] = {388880,2379,1281},
        [14] = {588880,5836,1281},
        -- ...
    },
}

 --每日消费
local consume_day =
{
    --[天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --天数可拓展
    [29] = 
    {
        [1] = {50,1287,1379},
        [2] = {100,1288,1379},
        [3] = {300,1289,1379},
        [4] = {600,1290,1379},
        [5] = {1500,1291,1379},
        [6] = {3000,1292,1379},
        [7] = {5000,1293,1379},
        [8] = {8000,1294,1379},
        [9] = {12000,1295,1379},
        [10] = {18888,1296,1379},
        -- ...
    },
    [30] = 
    {
        [1] = {50,1327,1380},
        [2] = {100,1328,1380},
        [3] = {300,1329,1380},
        [4] = {600,1330,1380},
        [5] = {1500,1331,1380},
        [6] = {3000,1332,1380},
        [7] = {5000,1333,1380},
        [8] = {8000,1334,1380},
        [9] = {12000,1335,1380},  
        [10] = {18888,1336,1380},
    },
	[31] = 
    {
        [1] = {50,1327,1382},
        [2] = {100,1328,1382},
        [3] = {300,1329,1382},
        [4] = {600,1330,1382},
        [5] = {1500,1331,1382},
        [6] = {3000,1332,1382},
        [7] = {5000,1333,1382},
        [8] = {8000,1334,1382},
        [9] = {12000,1335,1382},  
        [10] = {18888,1336,1382},
    },
	[32] = 
    {
        [1] = {50,2355,1383},
        [2] = {100,2356,1383},
        [3] = {300,2357,1383},
        [4] = {600,2358,1383},
        [5] = {1500,2359,1383},
        [6] = {3000,2360,1383},
        [7] = {5000,2361,1383},
        [8] = {8000,2362,1383},
        [9] = {12000,2363,1383},
        [10] = {18888,2364,1383},
    },
}

 --累积消费
local consume_period =
{
    --[天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --天数可拓展
      [34] = 
    {
        [1] = {60,1337,1456},
        [2] = {300,1338,1456},
        [3] = {1000,1339,1456},
        [4] = {3000,1340,1456},
        [5] = {5000,1341,1456},
        [6] = {8000,5943,1456},
        [7] = {10000,1343,1456},
        [8] = {20000,1344,1456},
        [9] = {50000,1345,1456},
        [10] = {100000,5959,1456},
    },
    [33] = 
    {
        [1] = {60,1337,1381},
        [2] = {300,1338,1381},
        [3] = {1000,1339,1381},
        [4] = {3000,1340,1381},
        [5] = {5000,1341,1381},
        [6] = {8000,5943,1381},
        [7] = {10000,1343,1381},
        [8] = {20000,1344,1381},
        [9] = {50000,1345,1381},
        [10] = {100000,5959,1381},
    },
}

 --国战参与奖
local nationwar_reward =
{
    --[天] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --天数可拓展
    [1] = {1426},	--1425
	[2] = {1427},
	[3] = {1428},
	-- [4] = {},
}

 --亲朋奖励
local truefriend_reward =
{
    --[要求亲朋数量] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --数量可拓展
	{5, 1740},
	{10, 1741},
	{15, 1742},
	{20, 1743},
	{30, 1744},
	{40, 1745},
	{50, 1746},
}

 --QQ、微信特权奖励礼包
local qqright_reward =
{
    --1、QQ会员新手礼包，2、QQ会员开通/续费礼包，3、超级QQ会员新手礼包，4、超级QQ会员开通/续费礼包，5、微信特权礼包
    --[奖励礼包类型] = {奖励模版ID1, 奖励模版ID2, ... , 奖励模版ID31}
    --数量可拓展
    [1] = {2458},
    [2] = {2460},
    [3] = {2459},
    [4] = {2461},
    [5] = {2457},
}

 --连续团购
local group_buy = 
{
    [1] = 
    {
        activity_id = 2495,
        data =
        {
            [53] = 
            {   serviceCode = 64,
                name = "68元團購",
                desc = "可獲得6080鑽等價豪禮",
                reward_id = 2367,
            },
            [54] = 
            {
                serviceCode = 71,
                name = "1340台幣團購",
                desc = "可獲得16880鑽等價豪禮",
                reward_id = 2368,
            },
	 [55] = 
            {
                serviceCode = 73,
                name = "2940台幣團購",
                desc = "可獲得36880鑽等價豪禮",
                reward_id = 2369,
            },
        }
    },
    [2] = 
    {
        activity_id = 3105,
        data =
        {
            [56] = 
            {   serviceCode = 61,
                name = "1元團購",
                desc = "可獲得328鑽等價豪禮",
                reward_id = 2372,
            },
            
            [57] = 
            {   serviceCode = 62,
                name = "3元團購",
                desc = "可獲得998鑽等價豪禮",
                reward_id = 2373,
            },
            
            [58] = 
            {   serviceCode = 63,
                name = "28元團購",
                desc = "可獲得1280鑽等價豪禮",
                reward_id = 2374,
            },
        }
    }
}

--连续消费
local continuous_buy = 
{
    activity_id = 5138,
    [1] = --100钻/980钻
    {
        reward_type = 102,
        diamonds = 980,
        today_reward_tid = {5139,5140,5141,13749,13750,13755,13756},
        [1] = {reward_tid = 5142, days = 1, reward_type = 103},
        [2] = {reward_tid = 5143, days = 3, reward_type = 104},
        [3] = {reward_tid = 5144, days = 5, reward_type = 105},
    },
    [2] = --300钻/1980钻
    {
        reward_type = 112,
        diamonds = 1980,
        today_reward_tid = {5145,5146,5147,13751,13752,13757,13758},
        [1] = {reward_tid = 5148, days = 1, reward_type = 113},
        [2] = {reward_tid = 5149, days = 3, reward_type = 114},
        [3] = {reward_tid = 5150, days = 5, reward_type = 115},
    },
    [3] = --1000钻/3280钻
    {
        reward_type = 122,
        diamonds = 3280,
        today_reward_tid = {5151,5152,5153,13753,13754,13759,13760},
        [1] = {reward_tid = 5154, days = 1, reward_type = 123},
        [2] = {reward_tid = 5155, days = 3, reward_type = 124},
        [3] = {reward_tid = 5156, days = 5, reward_type = 125},
    },
}

	
--尊享进阶
local growth_highlevel = 
{
    activity_id = 2546,
    data =
    {
        [1] =
        {
            reward_type = 59,
            title = "裝備",
            bonus = 
            {
                [1] =
                {
                    reward_id = 2567,
                    desc = "所有裝備達到36級可領取",
                    
                },
                [2] =
                {
                    reward_id = 2568,
                    desc = "所有裝備達到48級可領取",
                    
                },
                [3] =
                {
                    reward_id = 2569,
                    desc = "所有裝備達到60級可領取",
                    
                },
            },
            purchase =
            {
                [1] = { reward_id = 2547, price = 6980,},
                [2] = { reward_id = 2548, price = 9980,}, 
                [3] = { reward_id = 2549, price = 12980,},            
            }
        },
        [2] =
        {
            reward_type = 60,
            title = "神器",
            bonus = 
            {
                [1] =
                {
                    reward_id = 2570,
                    desc = "已裝備所有神器煉星等級達到12可領取",
                    
                },
                [2] =
                {
                    reward_id = 2571,
                    desc = "已裝備所有神器煉星等級達到18可領取",
                    
                },
                [3] =
                {
                    reward_id = 2572,
                    desc = "已裝備所有神器煉星等級達到24可領取",
                    
                },
            },
            purchase =
            {
                [1] = { reward_id = 2550, price = 6980,},
                [2] = { reward_id = 2551, price = 9980,}, 
                [3] = { reward_id = 2552, price = 12980,},            
            }
        },
        
    },
}


 --邀请回归好友奖励
local invitefriendback1_reward =
{
    --[] = { 回归好友个数，物品id， 物品数量 }
    --数量可拓展
    [1] = { needcount = 1, id = 1205, num = 1 },   
    [2] = { needcount = 3, id = 4523, num = 1 },
    [3] = { needcount = 5, id = 4524, num = 1},
}

-- 填写正确邀请码后领取奖励  
local invitefriendback2_reward = 
{
    -- [] = { 物品id， 物品数量  }
    -- 物品可扩展 
    [1] = { id = 10558 , num = 1 },
    [2] = { id = 12645, num = 1 },
    [3] = { id = 20335, num = 1},
    [4] = { id = 11387, num = 5},
}
-- 自然回归用户的奖励 
local invitefriendback3_reward = 
{
    -- [] = { 物品id， 物品数量  }
    -- 物品可扩展 
    [1] = { id = 4584 , num = 1 },
    [2] = { id = 6667, num = 1 },
    [3] = { id = 6996, num = 1},
    [4] = { id = 10561, num = 1},
}

--回归礼包
local player_back =
{
    [1] =  --第一天奖励
	{
		Pathid = 1182,
		Title1 = "回歸豪禮第一重",
		Title2 = "神級武器",
		Level30 = { 5367 },
		Level40 = { 5367 },
		Level50 = { 5367 },
		Level60 = { 5367 },
		Level70 = { 5367 },
		Level80 = { 5367 },
		Level90 = { 5367 },
		Level100 = { 5367 },
	},
    [2] =  --第二天奖励
	{
		Pathid = 1183,
		Title1 = "回歸豪禮第二重",
		Title2 = "神級鎧甲",
		Level30 = { 5368 },
		Level40 = { 5368 },
		Level50 = { 5368 },
		Level60 = { 5368 },
		Level70 = { 5368 },
		Level80 = { 5368 },
		Level90 = { 5368 },
		Level100 = { 5368 },
		},
    [3] = 
	{
		Pathid = 1186,
		Title1 = "回歸豪禮第三重",
		Title2 = "無字天書",
		Level30 = { 5369 },
		Level40 = { 5369 },
		Level50 = { 5369 },
		Level60 = { 5369 },
		Level70 = { 5369 },
		Level80 = { 5369 },
		Level90 = { 5369 },
		Level100 = { 5369 },
	},
    [4] = 
	{
		Pathid = 1184,
		Title1 = "回歸豪禮第四重",
		Title2 = "地術殘卷",
		Level30 = { 5370 },
		Level40 = { 5370 },
		Level50 = { 5370 },
		Level60 = { 5370 },
		Level70 = { 5370 },
		Level80 = { 5370 },
		Level90 = { 5370 },
		Level100 = { 5370 },
	},
    [5] = 
	{
		Pathid = 2447,
		Title1 = "回歸豪禮第五重",
		Title2 = "通靈神冊",
		Level30 = { 5371 },
		Level40 = { 5371 },
		Level50 = { 5371 },
		Level60 = { 5371 },
		Level70 = { 5371 },
		Level80 = { 5371 },
		Level90 = { 5371 },
		Level100 = { 5371 },
	},
    [6] = 
	{
		Pathid = 2443,
		Title1 = "回歸豪禮第六重",
		Title2 = "6級隨機寶石",
		Level30 = { 5372 },
		Level40 = { 5372 },
		Level50 = { 5372 },
		Level60 = { 5372 },
		Level70 = { 5372 },
		Level80 = { 5372 },
		Level90 = { 5372 },
		Level100 = { 5372 },
	},
    [7] = 
	{
		Pathid = 2375,
		Title1 = "回歸豪禮第七重",
		Title2 = "速龍寵物蛋",
		Level30 = { 5373 },
		Level40 = { 5373 },
		Level50 = { 5373 },
		Level60 = { 5373 },
		Level70 = { 5373 },
		Level80 = { 5373 },
		Level90 = { 5373 },
		Level100 = { 5373 },
	},
}

--限时回馈新消返
local activity_gift =
{
    activity_id = 12454,
    recharge =
    {
        reward_type = 136,
        reward_list =
        {
            [1] = {need_count = 600, reward_tid = 12442},
            [2] = {need_count = 3000, reward_tid = 12443},
            [3] = {need_count = 9800, reward_tid = 12444},
            [4] = {need_count = 19800, reward_tid = 12445},
            [5] = {need_count = 32800, reward_tid = 12446},
            [6] = {need_count = 64800, reward_tid = 12447},
        },
    },
    consume =
    {
        reward_type = 152,
        reward_list =
        {
            [1] = {need_count = 1000, reward_tid = 12448},
            [2] = {need_count = 4000, reward_tid = 12449},
            [3] = {need_count = 11000, reward_tid = 12450},
            [4] = {need_count = 22000, reward_tid = 12451},
            [5] = {need_count = 36000, reward_tid = 12452},
            [6] = {need_count = 72000, reward_tid = 12453},
        },
    },
}

--月签奖励Tips
local monthSignReward = 
{
    [1] = "連簽三月送[882bf1]鋒闕[-]",
    [2] = "連簽三月送[882bf1]鋒闕[-]",
    [3] = "連簽三月送[882bf1]鋒闕[-]",
    [4] = "連簽三月送[882bf1]閬淵[-]",
    [5] = "連簽三月送[882bf1]閬淵[-]",
    [6] = "連簽三月送[882bf1]閬淵[-]",
    [7] = "連簽三月送[882bf1]探索號[-]",
    [8] = "連簽三月送[882bf1]探索號[-]",
    [9] = "連簽三月送[882bf1]探索號[-]",
    [10] = "簽滿满25天送[882bf1]玄墨[-]",
    [11] = "連簽三月送[882bf1]廚師鴨[-]",
    [12] = "連簽三月送[882bf1]廚師鴨[-]",

}
--定点豪礼（指定在线）
local limitRewards = 
{
    -- [1] = { task_id = 2251, start_time = { hour = 12, min = 0, sec = 0 }, end_time = { hour = 13, min = 0, sec = 0 }, }, 
    -- [2] = { task_id = 2252, start_time = { hour = 13, min = 0, sec = 0 }, end_time = { hour = 14, min = 0, sec = 0 }, },
    -- [3] = { task_id = 2253, start_time = { hour = 18, min = 0, sec = 0 }, end_time = { hour = 19, min = 0, sec = 0 }, },
    -- [4] = { task_id = 2254, start_time = { hour = 20, min = 0, sec = 0 }, end_time = { hour = 21, min = 0, sec = 0 }, },
    TaskTimeCfg = 
    {
        [1] = { task_id = 2251, start_time = { hour = 12, min = 0, sec = 0 }, end_time = { hour = 14, min = 0, sec = 0 }, reward_tid = 5989,}, 
        [2] = { task_id = 2253, start_time = { hour = 18, min = 0, sec = 0 }, end_time = { hour = 20, min = 0, sec = 0 }, reward_tid = 5990,},
    },
    activity_id = 5389,		--定点豪礼的活动
}

return 
{
     vitalityRewards = vitality_reward,
	 dayActivityMaxNum = 100,    --日奖励所需活跃度上限
	 monthActivityMaxNum = 2200, --月奖励所需活跃度上限
     onlineRewards = online_reward,
     checkinRewards = checkin_reward,
     checkin_qqvip_reward = checkin_qqvip_reward, --QQ会员签到额外奖励
     checkin_qqsupervip_reward = checkin_qqsupervip_reward, --超级QQ会员签到额外奖励
     checkin_qqgamecenter_reward = checkin_qqgamecenter_reward, --QQ游戏中心签到额外奖励
     checkin_wxgamecenter_reward = checkin_wxgamecenter_reward, --微信游戏中心签到额外奖励
     qqright_reward = qqright_reward, --QQ、微信特权奖励礼包
     openday_reward = openday_reward,
	 topup_firsttime = topup_firsttime, --账号首充
	 topup_firsttimeperday = topup_firsttimeperday, --每日首充(废弃)
	 topup_day = topup_day, --每日充值
	 topup_period = topup_period, --累积充值
	 consume_day = consume_day, --每日消费
	 consume_period = consume_period, --累积消费
	 growthcapital_day = growthcapital_day, --成长基金时间版
	 growthcapital_level = growthcapital_level, --成长基金等级版
	 nationwar_reward = nationwar_reward,	--国战参与礼包
	 truefriend_reward =truefriend_reward,	--亲朋奖励
	 group_buy = group_buy,                 --连续团购
	 growth_highlevel = growth_highlevel,   --尊享进阶
	 lifetimereward = lifetimereward,   --终生返还
     continuous_buy = continuous_buy,   --连续充值
	 player_back = player_back, --回归礼包
     activity_gift = activity_gift, --六龙赠礼

    invitefriendback1_reward = invitefriendback1_reward, -- 邀请回归好友个数奖励
     invitefriendback2_reward = invitefriendback2_reward, -- 输入邀请码后作为回归用户的奖励 
     invitefriendback3_reward = invitefriendback3_reward, -- 自然回归用户的奖励 
    limitReward = limitRewards,             --定点豪礼（指定在线）
    monthSignRewardTips = monthSignReward,  --月签tips       
}