--[[
美女指导员
]]

local beauty_instructor = 
{
	--例子
	-- ['12345678'] = 
	-- {
	-- 	icon=1234,
	-- 	name='[美女指导员]',
		
	-- },

	
	['113538'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['179074'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['244610'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['310146'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

	['375682'] = 
	{
		icon=2387,
		name='[美女指導]',
	},

	['441218'] = 
	{
		icon=2386,
		name='[美女指導]',
	},

	['93538'] = 
	{
		icon=2381,
		name='[美女指導]',
	},

	['159074'] = 
	{
		icon=2385,
		name='[美女指導]',
	},

	['224610'] = 
	{
		icon=2379,
		name='[美女指導]',
	},

	['290146'] = 
	{
		icon=2380,
		name='[美女指導]',
	},

	['355682'] = 
	{
		icon=2384,
		name='[美女指導]',
	},

	['421218'] = 
	{
		icon=2382,
		name='[美女指導]',
	},

------------------2015-12-23新增------------------
	['506755'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['244611'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['572291'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['441219'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

	['310147'] = 
	{
		icon=2387,
		name='[美女指導]',
	},

	['179075'] = 
	{
		icon=2386,
		name='[美女指導]',
	},

	['355683'] = 
	{
		icon=2381,
		name='[美女指導]',
	},

	['224611'] = 
	{
		icon=2385,
		name='[美女指導]',
	},

	['159075'] = 
	{
		icon=2379,
		name='[美女指導]',
	},

	['93539'] = 
	{
		icon=2380,
		name='[美女指導]',
	},

	['290147'] = 
	{
		icon=2384,
		name='[美女指導]',
	},

	['421219'] = 
	{
		icon=2382,
		name='[美女指導]',
	},

	------------------2015-12-30新增------------------
	['244612'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['310148'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['375684'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['179076'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

	['113540'] = 
	{
		icon=2387,
		name='[美女指導]',
	},

	['441220'] = 
	{
		icon=2386,
		name='[美女指導]',
	},

	['421220'] = 
	{
		icon=2381,
		name='[美女指導]',
	},

	['159076'] = 
	{
		icon=2385,
		name='[美女指導]',
	},

	['93540'] = 
	{
		icon=2379,
		name='[美女指導]',
	},

	['224612'] = 
	{
		icon=2380,
		name='[美女指導]',
	},

	['190148'] = 
	{
		icon=2384,
		name='[美女指導]',
	},

	['355684'] = 
	{
		icon=2382,
		name='[美女指導]',
	},

	------------------2016-1-6新增------------------
	['179077'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['113541'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['441221'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['244613'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

	['310149'] = 
	{
		icon=2387,
		name='[美女指導]',
	},

	['375685'] = 
	{
		icon=2386,
		name='[美女指導]',
	},

	['355685'] = 
	{
		icon=2381,
		name='[美女指導]',
	},

	['93541'] = 
	{
		icon=2385,
		name='[美女指導]',
	},

	['290149'] = 
	{
		icon=2379,
		name='[美女指導]',
	},

	['224613'] = 
	{
		icon=2380,
		name='[美女指導]',
	},

	['159077'] = 
	{
		icon=2384,
		name='[美女指導]',
	},

	['421221'] = 
	{
		icon=2382,
		name='[美女指導]',
	},

	------------------2016-1-13新增------------------
	['375686'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['244614'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['441222'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['310150'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

	['179078'] = 
	{
		icon=2387,
		name='[美女指導]',
	},

	['506758'] = 
	{
		icon=2386,
		name='[美女指導]',
	},

	['355686'] = 
	{
		icon=2381,
		name='[美女指導]',
	},

	['93542'] = 
	{
		icon=2385,
		name='[美女指導]',
	},

	['159078'] = 
	{
		icon=2379,
		name='[美女指導]',
	},

	['224614'] = 
	{
		icon=2380,
		name='[美女指導]',
	},

	['290150'] = 
	{
		icon=2384,
		name='[美女指導]',
	},

	['421222'] = 
	{
		icon=2382,
		name='[美女指導]',
	},


	------------------2016-1-27新增------------------
	['572295'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['310151'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['441223'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['506759'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

	['179079'] = 
	{
		icon=2387,
		name='[美女指導]',
	},

	['244615'] = 
	{
		icon=2386,
		name='[美女指導]',
	},

	['93543'] = 
	{
		icon=2381,
		name='[美女指導]',
	},

	['159079'] = 
	{
		icon=2385,
		name='[美女指導]',
	},

	['224615'] = 
	{
		icon=2379,
		name='[美女指導]',
	},

	['355687'] = 
	{
		icon=2380,
		name='[美女指導]',
	},

	['486759'] = 
	{
		icon=2384,
		name='[美女指導]',
	},

	['421223'] = 
	{
		icon=2382,
		name='[美女指導]',
	},

	------------------2016-1-27补充------------------
	['113545'] = 
	{
		icon=2391,
		name='[美女指導]',
	},

	['93545'] = 
	{
		icon=2390,
		name='[美女指導]',
	},

	['113544'] = 
	{
		icon=2388,
		name='[美女指導]',
	},

	['224616'] = 
	{
		icon=2389,
		name='[美女指導]',
	},

}

return beauty_instructor