local FourSpiritCfg = {}
FourSpiritCfg =
{
	--以下是每次重开需要配置的
	OpenInstance = 1,					--1表示青龙,2表示朱雀,3表示白虎,4表示玄武
	TaskID = 2840,					--计次任务ID 2840青龙 2841朱雀 2842白虎 2843玄武
	HintTimeStr = "12月20日至12月26日 18:00-22:00",	--当前点选时间文本
	
	
	--以下无需调整
	InstanceTaskID=						--表示对应副本任务ID							
	{
		[1] = 2840,
		[2] = 2841,
		[3] = 2842,
		[4] = 2843,
	},

	OpenTimeStr = {
		[1] = "",
		[2] = "",
		[3] = "",
		[4] = "",
	},

	InstanceID=						--表示对应副本模板ID							
	{
		[1] = 7113,
		[2] = 6972,
		[3] = 7188,
		[4] = 7189,
	},	
	HintStr = "敬請期待" ,					--非当前点选提示
	InstanceVictoryRewardID=				--副本通关显示的奖励模板ID
	{
		[1] = 7129,
		[2] = 7130,
		[3] = 7131,
		[4] = 7132,
	},
	--以下campaign.lua需要调用的地方
	id=
	{
		[1] = 7139,
		[2] = 7140,
		[3] = 7141,
		[4] = 7142,
	},
	name=
	{
		[1] = "聖獸青龍",
		[2] = "聖獸朱雀",
		[3] = "聖獸白虎",
		[4] = "聖獸玄武",
	},
	icon_pathid=
	{
		[1] = 4585,
		[2] = 4958,
		[3] = 4586,
		[4] = 4587,
	},
	detail_desc=
	{
		[1] = "挑戰聖獸青龍可獲得人皇遺篇，並有幾率獲得絕世坐騎青龍之靈。",
		[2] = "挑戰聖獸朱雀可獲得人皇遺篇，並有幾率獲得絕世坐騎朱雀之靈。",
		[3] = "挑戰聖獸白虎可獲得人皇遺篇，並有幾率獲得絕世坐騎白虎之靈。",
		[4] = "挑戰聖獸玄武可獲得人皇遺篇，並有幾率獲得絕世坐騎玄武之靈。",
	},
	tip=
	{
		[1] = "青龍之靈",
		[2] = "朱雀之靈",
		[3] = "白虎之靈",
		[4] = "玄武之靈",
	},		
}
return FourSpiritCfg 