local hero_fight = {}

--corps = 1时为乱世诸侯，当前诸侯有 吕布S、马超A、董卓B、孟获C、张角D
--corps = 0时为一般武将
hero_fight[1] =
{
	npcid = 1362,												--npc模板
	rank = 5,												--星级
	desc = "[ffd800]亂世諸侯！成功討伐後將有額外獎勵！！[-]\n呂布  （？-199年）字奉先，東漢末年名將，五原郡九原人。先後為丁原、董卓部將，但呂布先後叛變並謀害了他們，自成一方諸侯。其武藝精湛，向來被公認為三國第一的猛將。",								--描述
	award = {1560,4760,6748,4748},	
	corps = 1,									--是乱世诸侯写1
}

hero_fight[2] =
{
	npcid = 1363,												--npc模板
	rank = 5,												--星级
	desc = "諸葛亮  （181年-234年）字孔明，號臥龍居士。徐州琅琊人，傑出的政治、軍事和發明家。竭盡一生為蜀漢復興而努力，被後世尊稱為忠武侯。是中華傳統文化中，忠臣與智慧的化身。",								--描述
	award = {1556,4760,6748},									--奖励物品id
	corps = 0       --非乱世诸侯写0
}

hero_fight[3] =
{
	npcid = 1364,												--npc模板
	rank = 5,												--星级
	desc = "司馬懿  （179年-251年）字仲達，河內溫縣人。魏國傑出的政治家、軍事家。是輔佐魏國四代君主的托孤重臣。生性奸詐善於奇謀，多次率軍抵抗諸葛亮的北伐，並且平定遼東諸郡。是諸葛亮宿命中的敵手與剋星。",								--描述
	award = {1573,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[4] =
{
	npcid = 1365,												--npc模板
	rank = 5,												--星级
	desc = "關羽  （162-220年）字雲長，別字長生。東漢蜀國名將，隨劉備輾轉各地，土山盟誓後隨曹操參加官渡之戰，斬殺袁紹大將顏良、文醜。赤壁之戰後關羽圍襄陽，擒於禁，斬龐德。死後被民間尊為——關公。",								--描述
	award = {1559,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[5] =
{
	npcid = 1366,												--npc模板
	rank = 5,												--星级
	desc = "張飛  （166-221年）字翼德，幽州涿郡人，蜀國名將。長阪坡劉備潰退，張飛率二十人據水而守，曹軍無人敢近。劉備入蜀時于江州義釋嚴顏，漢中戰役時擊敗張郃。其勇猛、魯莽令人聞風喪膽。",								--描述
	award = {1558,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[6] =
{
	npcid = 1367,												--npc模板
	rank = 5,												--星级
	desc = "孫策  （175年-200年）字伯符，吳郡富春人，孫權之兄。漢末群雄之一，吳國的奠基者。綽號小霸王，兼併江東諸侯，統一江東。當時無人可抑其鋒，在其志得意滿之時死于刺客的暗殺，壽止二十六歲。",								--描述
	award = {1572,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[7] =
{
	npcid = 1368,												--npc模板
	rank = 3,												--星级
	desc = "許褚  （？-？）字仲康，亳州譙縣人。身材高大雄偉，勇力絕倫。號稱有橫推八馬，倒拽九牛之力。為曹操貼身護衛，多次拼死將曹操救出虎口。其佇立在曹操身邊時，連猛將馬超都不敢上前。被人尊稱為——虎侯。",								--描述
	award = {1569,4758,6748},									--奖励物品id
	corps = 0
}

hero_fight[8] =
{
	npcid = 1369,												--npc模板
	rank = 3,												--星级
	desc = "甘寧  （？-220年）字興霸，巴郡臨江人。年少曾為水賊，性情豪放張揚，衣著華麗，人稱錦帆賊。先侍奉劉表，後投效孫權，先後與曹仁、關羽等名將交鋒而未嘗敗績，戰功赫赫，官拜折衝將軍。",								--描述
	award = {1582,4758,6748},									--奖励物品id
	corps = 0
}

hero_fight[9] =
{
	npcid = 1370,												--npc模板
	rank = 5,												--星级
	desc = "貂蟬  （176-？）中國古代四大美女之一，山西忻州人。身姿優美嫺靜，傳說其午夜拜月，嫦娥自愧不如，而將月亮隱入雲中。為結束群雄割據的亂世，協助王允施展連環計，殺死董卓。呂布死後，貂蟬再無下落，不知所終。",								--描述
	award = {1566,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[10] =
{
	npcid = 1371,												--npc模板
	rank = 5,												--星级
	desc = "劉備  （161年-223年）字玄德，幽州涿縣人，蜀漢開國皇帝。早年顛沛流離，後於赤壁之戰聯手孫權擊敗曹操，奪荊、益，建立蜀漢。其寬厚仁義，百折不撓，終於成就其大業。與關羽、張飛之間的友誼，也被後人所稱頌。",								--描述
	award = {1554,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[11] =
{
	npcid = 1372,												--npc模板
	rank = 5,												--星级
	desc = "孫權  （182年-252年）字仲謀。吳郡富春人，東吳的君主。孫策被刺殺身亡，孫權繼承基業，年少有為。多次與蜀漢聯手攻擊曹魏。安撫山越蠻人、將吳國疆域擴至最大，是三國所有皇帝中，最長壽的一位。",								--描述
	award = {1563,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[12] =
{
	npcid = 1373,												--npc模板
	rank = 5,												--星级
	desc = "曹操  （155年-220年）字孟德。亳州譙縣人，傑出的政治、軍事、文學家，曹魏的締造者。挾持漢天子以令四方，消滅袁紹、呂布、劉表、西涼等諸侯勢力，征服匈奴、烏桓，統一了北方。其子曹丕稱帝，追尊曹操為——武帝。",								--描述
	award = {1568,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[13] =
{
	npcid = 1374,												--npc模板
	rank = 2,												--星级
	desc = "大喬  （？-？）廬江郡皖縣人。孫策的妻子，小喬的姐姐。因其美貌，與小喬並稱江東二喬。",								--描述
	award = {1562,4757,6748},									--奖励物品id
	corps = 0
}

hero_fight[14] =
{
	npcid = 1375,												--npc模板
	rank = 2,												--星级
	desc = "小喬  （？-？）廬江郡皖縣人。周瑜的妻子，大喬的妹妹。因其美貌，與大喬並稱江東二喬。",								--描述
	award = {1564,4757,6748},									--奖励物品id
	corps = 0
}

hero_fight[15] =
{
	npcid = 1376,												--npc模板
	rank = 4,												--星级
	desc = "[ffd800]亂世諸侯！成功討伐後將有額外獎勵！！[-]\n馬超  （176年-223年）字孟起，扶風郡茂陵人。馬騰之子，蜀漢開國名將。早年隨父親征戰，為漢末群雄之一，勇力不遜呂布。潼關戰役中被曹操擊敗，後投效劉備。因其相貌俊逸，衣飾華麗，被稱為錦馬超",								--描述
	award = {1578,4759,6748,4747},									--奖励物品id
	corps = 1
}

hero_fight[16] =
{
	npcid = 1377,												--npc模板
	rank = 5,												--星级
	desc = "趙雲  （？-229年）字子龍，常山真定人。身姿雄偉，武藝精湛，膽色過人，作為蜀國名將，追隨劉備近三十年。先後參加博望坡、長阪坡之戰、入川戰役、漢水、箕谷之戰，功勛卓著。",								--描述
	award = {1555,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[17] =
{
	npcid = 1378,												--npc模板
	rank = 5,												--星级
	desc = "周瑜  （175年-210年）字公瑾，廬江人。二十一歲隨孫策平定江東，後輔佐孫權，稱為孫吳安邦重臣。建安十三年率軍與劉備軍聯合於赤壁大敗曹操。其風姿俊逸，才貌無雙，被時人稱為美周郎。",								--描述
	award = {1580,4760,6748},									--奖励物品id
	corps = 0
}

hero_fight[18] =
{
	npcid = 1379,												--npc模板
	rank = 1,												--星级
	desc = "黃月英  （？-？）荊州白水人。名士黃承彥之女，諸葛亮的妻子。相傳其貌不揚，也有一說其本貌美，遭人豔羨嫉妒而譖傳其醜。月英的知識廣博，通曉兵法。其機關數術、文韜武略不在諸葛亮之下。",								--描述
	award = {1561,4756,6748},									--奖励物品id
	corps = 0
}

hero_fight[19] =
{
	npcid = 1380,												--npc模板
	rank = 2,												--星级
	desc = "[ffd800]亂世諸侯！成功討伐後將有額外獎勵！！[-]\n孟獲  （？-？）南中一代蠻族首領，被當地蠻夷敬仰，曾因雍闓煽動而起兵叛蜀。後諸葛亮親征南中，屢敗孟獲，孟獲也以百折不撓的精神與諸葛亮鬥智鬥勇，最終臣服，並且遵守諾言，終生不再叛變。",								--描述
	award = {1571,4757,6748,4745},									--奖励物品id
	corps = 1
}

hero_fight[20] =
{
	npcid = 1381,												--npc模板
	rank = 1,												--星级
	desc = "[ffd800]亂世諸侯！成功討伐後將有額外獎勵！！[-]\n張角  （？-184年）冀州巨鹿人，漢末亂軍黃巾軍領袖，太平道教祖，趁東漢衰微之機發動民變，自稱天公將軍。其弟張寶、張梁隨後繼承其衣缽。黃巾之亂成為群雄逐鹿的導火索，開啟了三國時代亂世的篇章。",								--描述
	award = {1557,4756,6748,4744},									--奖励物品id
	corps = 1
}

hero_fight[21] =
{
	npcid = 1382,												--npc模板
	rank = 1,												--星级
	desc = "馬雲祿  （？-？）扶風郡茂陵人，馬騰之女，馬超之妹，趙雲的妻子。在為父親復仇的路上遭遇趙雲，並被其擊敗，因此對趙雲一見鍾情。性格頑皮衝動，經常讓馬超和趙雲不知所措。",								--描述
	award = {1579,4756,6748},									--奖励物品id
	corps = 0
}

hero_fight[22] =
{
	npcid = 1383,												--npc模板
	rank = 3,												--星级
	desc = "甄宓  （183年-221年）冀州中山人，魏文帝曹丕的妻子，曹叡的母親。建安九年袁紹被曹操攻滅，曹丕對本為袁熙妻子的甄宓一見鍾情而免其一死，隨後由曹操做主迎娶。曹植所作的洛神賦，便是歌頌其美貌的詩詞。",								--描述
	award = {1565,4758,6748},									--奖励物品id
	corps = 0
}

hero_fight[23] =
{
	npcid = 1384,												--npc模板
	rank = 2,												--星级
	desc = "關鳳  （？-？）關羽的女兒，女中豪傑，性情驕傲矜持，頗有其父之風。孫權曾派使者向關羽請求聯姻，希望能將關鳳嫁給孫權的兒子，但是關羽羞辱了孫吳的使臣，導致孫權的記恨。關羽被殺後關鳳與孫家結下血海深仇。",								--描述
	award = {1577,4757,6748},									--奖励物品id
	corps = 0
}

hero_fight[24] =
{
	npcid = 1385,												--npc模板
	rank = 3,												--星级
	desc = "[ffd800]亂世諸侯！成功討伐後將有額外獎勵！！[-]\n董卓  （？-192年）字仲穎，涼州軍閥，靈帝末年受命進京，趁十常侍之亂掌握大權。殘忍嗜殺，荒淫好色，招致群雄聯合討伐。其善於掌握人心之險惡，利用群雄間利益糾葛，成功瓦解了聯軍。但是隨即被背叛的呂布暗殺。",								--描述
	award = {1570,4758,6748,4746},									--奖励物品id
	corps = 1
}

hero_fight[25] =
{
	npcid = 1386,												--npc模板
	rank = 1,												--星级
	desc = "祝融夫人   （？-？）蠻王孟獲的妻子，傳說為火神的後裔，弓馬嫺熟武藝卓絕，曾以一敵二輕鬆殺敗魏延與馬岱的聯手夾擊，並生擒張嶷、馬忠等蜀將。最終被趙雲用計擒獲。後隨孟獲投降蜀漢，終生不再背叛。",								--描述
	award = {1574,4756,6748},									--奖励物品id
	corps = 0
}

hero_fight[26] =
{
	npcid = 1387,												--npc模板
	rank = 3,												--星级
	desc = "太史慈  （166年-206年）字子義，東萊黃縣人。原為劉繇部下，武藝絕倫，擅使槍、鐧、弓、戟等多種兵器，真正的武器大師。與小霸王孫策酣鬥，不分伯仲。英雄相惜，最終太史慈投靠孫策，成為江東不可或缺的戰力。",								--描述
	award = {1576,4758,6748},									--奖励物品id
	corps = 0
}

hero_fight[27] =
{
	npcid = 1388,												--npc模板
	rank = 4,												--星级
	desc = "張遼  （169年-222年）字文遠，雁門馬邑人，魏國著名將領。下邳戰役後歸順曹操，官渡之戰與關羽協力解圍，後攻破鄴城、平定遼東、攻取淮南、鎮守合肥新城，銳不可擋，相傳在敵國提起張遼威名，小兒都驚懼不敢出聲。",								--描述
	award = {1581,4759,6748},									--奖励物品id
	corps = 0
}

hero_fight[28] =
{
	npcid = 1389,												--npc模板
	rank = 4,												--星级
	desc = "孫尚香  （？-？）孫權的妹妹，劉備的夫人。本來作為周瑜騙取劉備來東吳的誘餌，卻在諸葛亮的損招之下假戲真做與劉備成了真夫妻。據周瑜說，孫夫人極為悍勇，不亞男子。閨房中兵器排布，侍婢也均是高手。因而被時人稱為——梟姬。",								--描述
	award = {1575,4759,6748},									--奖励物品id
	corps = 0
}

hero_fight[29] =
{
	npcid = 1390,												--npc模板
	rank = 4,												--星级
	desc = "夏侯惇  （？-220年）字元讓，曹魏開國元勳，初代大將軍。多次為曹操鎮守後方，作為東線兵馬總統帥，歷任要職。一生戎馬，為人簡樸寬厚，終生不置家產，不留餘財。兗州戰役時左眼被箭射傷，被人稱為——盲夏侯。",								--描述
	award = {1567,4759,6748},									--奖励物品id
	corps = 0
}

hero_fight[30] =
{
	npcid = 1542,												--npc模板
	rank = 4,												--星级
	desc = "曹仁  （168年-223年）字子孝，曹操的從弟，為魏國立下汗馬功勞。先後參加官渡之戰、赤壁之戰、第一第二次襄樊之戰、渭水之戰。其功勛在同朝武將中，只有夏侯惇可比。就連智勇如周瑜，面對曹仁都感覺十分棘手。",								--描述
	award = {1588,4759,6748},									--奖励物品id
	corps = 0
}

hero_fight[31] =
{
	npcid = 2569,												--npc模板
	rank = 2,												--星级
	desc = "呂綺玲  （？-？）呂布與嚴氏之女，生卒年不詳。下邳戰役時呂布遭到曹操圍困，作為派出援軍的條件，呂綺玲與袁術之子曾有政治婚姻，但於出嫁途中被劉備與曹操阻截因而返回。呂布死後便無人知其蹤。",								--描述
	award = {1608,4757,6748},									--奖励物品id
	corps = 0
}

hero_fight[32] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9235,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[33] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9240,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[34] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9242,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[35] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9241,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[36] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9225,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[37] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9231,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[38] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9237,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[39] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9239,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[40] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9230,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[41] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9236,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[42] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9233,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[43] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9234,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[44] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9226,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[45] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9227,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[46] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9229,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[47] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9232,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[48] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9223,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[49] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9222,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[50] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9224,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[51] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9228,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[52] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9502,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[53] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9501,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[54] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9503,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[55] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9504,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[56] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9505,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[57] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9495,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[58] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9497,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[59] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9499,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[60] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9500,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[61] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9506,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[62] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9489,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[63] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9492,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[64] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9493,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[65] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9494,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[66] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9496,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[67] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9498,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[68] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9483,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[69] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9486,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[70] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9487,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[71] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9490,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[72] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9488,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[73] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9491,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[74] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9479,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[75] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9480,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[76] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9481,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[77] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9482,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[78] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9484,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[79] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9485,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[80] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9532,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[81] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9528,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[82] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9529,10529,6748},									--奖励物品id
	corps = 0
}


hero_fight[83] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9530,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[84] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9531,10529,6748},									--奖励物品id
	corps = 0
}


hero_fight[85] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9523,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[86] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9524,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[87] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9525,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[88] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9526,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[89] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9527,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[90] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9512,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[91] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9518,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[92] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9519,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[93] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9520,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[94] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9521,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[95] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9514,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[96] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9515,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[97] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9516,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[98] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9517,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[99] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9522,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[100] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9507,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[101] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9508,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[102] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9509,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[103] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9510,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[104] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9511,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[105] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9513,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[106] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9544,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[107] =
{
	npcid = 10459,												--npc模板
	rank = 1,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9546,10529,6748},									--奖励物品id
	corps = 0
}

hero_fight[108] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9543,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[109] =
{
	npcid = 10460,												--npc模板
	rank = 2,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9545,10530,6748},									--奖励物品id
	corps = 0
}

hero_fight[110] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9537,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[111] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9539,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[112] =
{
	npcid = 10461,												--npc模板
	rank = 3,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9541,10531,6748},									--奖励物品id
	corps = 0
}

hero_fight[113] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9536,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[114] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9538,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[115] =
{
	npcid = 10462,												--npc模板
	rank = 4,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9542,10532,6748},									--奖励物品id
	corps = 0
}

hero_fight[116] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9533,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[117] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9534,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[118] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9535,10533,6748},									--奖励物品id
	corps = 0
}

hero_fight[119] =
{
	npcid = 10463,												--npc模板
	rank = 5,												--星级
	desc = "東周  （前770年-前256年）都城洛邑，姬姓王朝。東周又分為春秋及戰國兩個時期，英才輩出，百家爭鳴。東周滅亡後，周人後裔並未滅絕，而是隱於民間，以圖東山再起，重現昔日榮光。",								--描述
	award = {9540,10533,6748},									--奖励物品id
	corps = 0
}

return hero_fight

