
--八阵图副本相关

local eightBlast = eightBlast or {}

--八阵图：每阵型信息
eightBlast.Chapters = 
{
	[1] = 
	{ 
		tid = 2125, 
		name = "天覆陣", 
		explain = "天陣十六，外方內圓，四為風揚，其形象天。為陣之主，衛兵之先，善用三軍，其形不偏。", 
	},

 	[2] = 
	{ 
		tid = 2126, 
		name = "地載陣", 
		explain = "地陣十二，其形正方，雲主四角，沖敵難當。其體莫測，動用無窮，獨立不可，配之於陽。", 
	},

	[3] = 
	{ 
		tid = 2127, 
		name = "風揚陣", 
		explain = "風無正形，附之於天，變而為蛇，其意漸玄。風能鼓物，萬物繞焉，蛇能為繞，三軍懼焉。", 
	},

	[4] = 
	{ 
		tid = 2128, 
		name = "雲垂陣", 
		explain = "雲附於地，始則無形，變為翔鳥，其狀乃成。鳥能突出，雲能晦異，千變萬化，金革之聲。", 
	},

	[5] = 
	{ 
		tid = 2129, 
		name = "龍飛陣", 
		explain = "天地後沖，龍變其中，有爪有足，有背有胸。潛則不測，動則無窮，陣形赫然，名象為龍。", 
	},

	[6] = 
	{ 
		tid = 2130, 
		name = "虎翼陣", 
		explain = "天地前沖，變為虎翼，伏虎將搏，盛其威力。淮陰用之，變為無極，垓下之會，魯公莫測。", 
	},

	[7] = 
	{ 
		tid = 2131, 
		name = "鳥翔陣", 
		explain = "鷙鳥將搏，必先翱翔，勢臨霄漢，飛禽伏藏。審之而下，必有中傷，一夫突擊，三軍莫當。", 
	},

	[8] = 
	{ 
		tid = 2132, 
		name = "蛇蟠陣", 
		explain = "風為蛇蟠，附天成形，勢能圍繞，性能屈伸。四奇之中，與虎為鄰，後變常山，首尾相困。", 
	},
	
	[9] = 
	{ 
		tid = 3000, 
		name = "天絕陣", 
		explain = "天地三才顛倒推，玄中玄妙更難猜。神仙弱遇天絕陣，頃刻肢體化為灰。", 
	},

	[10] = 
	{ 
		tid = 3001, 
		name = "地烈陣", 
		explain = "地烈煉成分濁厚，上雷下火太無情。就是五行幹健體，難逃骨化與形傾。", 
	},
	
	[11] = 
	{ 
		tid = 3002, 
		name = "風吼陣", 
		explain = "風吼陣中兵刃窩，暗藏玄妙若天羅。傷人不怕神仙體，消盡渾身血肉多。", 
	},

	[12] = 
	{ 
		tid = 3003, 
		name = "寒冰陣", 
		explain = "玄功煉就號寒冰，一座刀山上下凝。若是人仙逢此陣，連皮帶骨盡無憑。", 
	},
	
	[13] = 
	{ 
		tid = 3004, 
		name = "金光陣", 
		explain = "寶鏡非銅又非金，不向爐中火內尋。縱有天仙逢此陣，須臾形化更難禁。", 
	},
	
	[14] = 
	{ 
		tid = 3005, 
		name = "化血陣", 
		explain = "黃風卷起黑砂飛，天地無光動殺威。任你仙人聞此氣，涓涓血水濺征衣。", 
	},
	
	[15] = 
	{ 
		tid = 3006, 
		name = "落魂陣", 
		explain = "白紙幡搖黑氣生，煉成妙術透虛盈。從來不信神仙體，入陣魂消魄自傾。", 
	},
	
	[16] = 
	{ 
		tid = 3007, 
		name = "紅沙陣", 
		explain = "紅砂一撮道無窮，八卦爐中玄妙功。萬象包羅為一處，方知截教有鴻蒙。", 
	},
	[17] = 
	{ 
		tid = 5919, 
		name = "六合陣", 
		explain = "紅砂一撮道無窮，八卦爐中玄妙功。萬象包羅為一處，方知截教有鴻蒙。", 
	},
}


--阵型中的房间信息: 房间对应成就
--name后的文字没用

eightBlast.SubChapters = 
{
	[1] =  
 	{
 		[1] = { achieveId = 646, bossId = 5578, name = "天覆陣·乾卦", explain = "擊殺天覆陣·乾陣護法可開啟本卦象，擊殺天覆陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 649, bossId = 5581, name = "天覆陣·巽卦", explain = "擊殺天覆陣·巽陣護法可開啟本卦象，擊殺天覆陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 650, bossId = 5582, name = "天覆陣·坎卦", explain = "擊殺天覆陣·坎陣護法可開啟本卦象，擊殺天覆陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 652, bossId = 5584, name = "天覆陣·艮卦", explain = "擊殺天覆陣·艮陣護法可開啟本卦象，擊殺天覆陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 647, bossId = 5579, name = "天覆陣·坤卦", explain = "擊殺天覆陣·坤陣護法可開啟本卦象，擊殺天覆陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 648, bossId = 5580, name = "天覆陣·震卦", explain = "擊殺天覆陣·震陣護法可開啟本卦象，擊殺天覆陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 651, bossId = 5583, name = "天覆陣·離卦", explain = "擊殺天覆陣·離陣護法可開啟本卦象，擊殺天覆陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 653, bossId = 5585, name = "天覆陣·兌卦", explain = "擊殺天覆陣·兌陣護法可開啟本卦象，擊殺天覆陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 710, bossId = 5642, name = "天覆陣·陰陽", explain = "擊殺天覆陣陣眼可開啟陰陽卦象，開啟天覆陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[2] =  
 	{
 		[1] = { achieveId = 654, bossId = 5586, name = "地載陣·乾卦", explain = "擊殺地載陣·乾陣護法可開啟本卦象，擊殺地載陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 657, bossId = 5589, name = "地載陣·巽卦", explain = "擊殺地載陣·巽陣護法可開啟本卦象，擊殺地載陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 658, bossId = 5590, name = "地載陣·坎卦", explain = "擊殺地載陣·坎陣護法可開啟本卦象，擊殺地載陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 660, bossId = 5592, name = "地載陣·艮卦", explain = "擊殺地載陣·艮陣護法可開啟本卦象，擊殺地載陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 655, bossId = 5587, name = "地載陣·坤卦", explain = "擊殺地載陣·坤陣護法可開啟本卦象，擊殺地載陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 656, bossId = 5588, name = "地載陣·震卦", explain = "擊殺地載陣·震陣護法可開啟本卦象，擊殺地載陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 659, bossId = 5591, name = "地載陣·離卦", explain = "擊殺地載陣·離陣護法可開啟本卦象，擊殺地載陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 661, bossId = 5593, name = "地載陣·兌卦", explain = "擊殺地載陣·兌陣護法可開啟本卦象，擊殺地載陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 711, bossId = 5643, name = "地載陣·陰陽", explain = "擊殺地載陣陣眼可開啟陰陽卦象，開啟地載陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[3] =  
 	{
 		[1] = { achieveId = 662, bossId = 5594, name = "風揚陣·乾卦", explain = "擊殺風揚陣·乾陣護法可開啟本卦象，擊殺風揚陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 665, bossId = 5597, name = "風揚陣·巽卦", explain = "擊殺風揚陣·巽陣護法可開啟本卦象，擊殺風揚陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 666, bossId = 5598, name = "風揚陣·坎卦", explain = "擊殺風揚陣·坎陣護法可開啟本卦象，擊殺風揚陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 668, bossId = 5600, name = "風揚陣·艮卦", explain = "擊殺風揚陣·艮陣護法可開啟本卦象，擊殺風揚陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 663, bossId = 5595, name = "風揚陣·坤卦", explain = "擊殺風揚陣·坤陣護法可開啟本卦象，擊殺風揚陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 664, bossId = 5596, name = "風揚陣·震卦", explain = "擊殺風揚陣·震陣護法可開啟本卦象，擊殺風揚陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 667, bossId = 5599, name = "風揚陣·離卦", explain = "擊殺風揚陣·離陣護法可開啟本卦象，擊殺風揚陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 669, bossId = 5601, name = "風揚陣·兌卦", explain = "擊殺風揚陣·兌陣護法可開啟本卦象，擊殺風揚陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 712, bossId = 5644, name = "風揚陣·陰陽", explain = "擊殺風揚陣陣眼可開啟陰陽卦象，開啟風揚陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[4] =  
 	{
 		[1] = { achieveId = 670, bossId = 5602, name = "雲垂陣·乾卦", explain = "擊殺雲垂陣·乾陣護法可開啟本卦象，擊殺雲垂陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 673, bossId = 5605, name = "雲垂陣·巽卦", explain = "擊殺雲垂陣·巽陣護法可開啟本卦象，擊殺雲垂陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 674, bossId = 5606, name = "雲垂陣·坎卦", explain = "擊殺雲垂陣·坎陣護法可開啟本卦象，擊殺雲垂陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 676, bossId = 5608, name = "雲垂陣·艮卦", explain = "擊殺雲垂陣·艮陣護法可開啟本卦象，擊殺雲垂陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 671, bossId = 5603, name = "雲垂陣·坤卦", explain = "擊殺雲垂陣·坤陣護法可開啟本卦象，擊殺雲垂陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 672, bossId = 5604, name = "雲垂陣·震卦", explain = "擊殺雲垂陣·震陣護法可開啟本卦象，擊殺雲垂陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 675, bossId = 5607, name = "雲垂陣·離卦", explain = "擊殺雲垂陣·離陣護法可開啟本卦象，擊殺雲垂陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 677, bossId = 5609, name = "雲垂陣·兌卦", explain = "擊殺雲垂陣·兌陣護法可開啟本卦象，擊殺雲垂陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 713, bossId = 5645, name = "雲垂陣·陰陽", explain = "擊殺雲垂陣陣眼可開啟陰陽卦象，開啟雲垂陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[5] =  
 	{
 		[1] = { achieveId = 678, bossId = 5610, name = "龍飛陣·乾卦", explain = "擊殺龍飛陣·乾陣護法可開啟本卦象，擊殺龍飛陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 681, bossId = 5613, name = "龍飛陣·巽卦", explain = "擊殺龍飛陣·巽陣護法可開啟本卦象，擊殺龍飛陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 682, bossId = 5614, name = "龍飛陣·坎卦", explain = "擊殺龍飛陣·坎陣護法可開啟本卦象，擊殺龍飛陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 684, bossId = 5616, name = "龍飛陣·艮卦", explain = "擊殺龍飛陣·艮陣護法可開啟本卦象，擊殺龍飛陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 679, bossId = 5611, name = "龍飛陣·坤卦", explain = "擊殺龍飛陣·坤陣護法可開啟本卦象，擊殺龍飛陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 680, bossId = 5612, name = "龍飛陣·震卦", explain = "擊殺龍飛陣·震陣護法可開啟本卦象，擊殺龍飛陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 683, bossId = 5615, name = "龍飛陣·離卦", explain = "擊殺龍飛陣·離陣護法可開啟本卦象，擊殺龍飛陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 685, bossId = 5617, name = "龍飛陣·兌卦", explain = "擊殺龍飛陣·兌陣護法可開啟本卦象，擊殺龍飛陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 714, bossId = 5646, name = "龍飛陣·陰陽", explain = "擊殺龍飛陣陣眼可開啟陰陽卦象，開啟龍飛陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[6] =  
 	{
 		[1] = { achieveId = 686, bossId = 5618, name = "虎翼陣·乾卦", explain = "擊殺虎翼陣·乾陣護法可開啟本卦象，擊殺虎翼陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 689, bossId = 5621, name = "虎翼陣·巽卦", explain = "擊殺虎翼陣·巽陣護法可開啟本卦象，擊殺虎翼陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 690, bossId = 5622, name = "虎翼陣·坎卦", explain = "擊殺虎翼陣·坎陣護法可開啟本卦象，擊殺虎翼陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 692, bossId = 5624, name = "虎翼陣·艮卦", explain = "擊殺虎翼陣·艮陣護法可開啟本卦象，擊殺虎翼陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 687, bossId = 5619, name = "虎翼陣·坤卦", explain = "擊殺虎翼陣·坤陣護法可開啟本卦象，擊殺虎翼陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 688, bossId = 5620, name = "虎翼陣·震卦", explain = "擊殺虎翼陣·震陣護法可開啟本卦象，擊殺虎翼陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 691, bossId = 5623, name = "虎翼陣·離卦", explain = "擊殺虎翼陣·離陣護法可開啟本卦象，擊殺虎翼陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 693, bossId = 5625, name = "虎翼陣·兌卦", explain = "擊殺虎翼陣·兌陣護法可開啟本卦象，擊殺虎翼陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 715, bossId = 5647, name = "虎翼陣·陰陽", explain = "擊殺虎翼陣陣眼可開啟陰陽卦象，開啟虎翼陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[7] =  
 	{
 		[1] = { achieveId = 694, bossId = 5626, name = "鳥翔陣·乾卦", explain = "擊殺鳥翔陣·乾陣護法可開啟本卦象，擊殺鳥翔陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 697, bossId = 5629, name = "鳥翔陣·巽卦", explain = "擊殺鳥翔陣·巽陣護法可開啟本卦象，擊殺鳥翔陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 698, bossId = 5630, name = "鳥翔陣·坎卦", explain = "擊殺鳥翔陣·坎陣護法可開啟本卦象，擊殺鳥翔陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 700, bossId = 5632, name = "鳥翔陣·艮卦", explain = "擊殺鳥翔陣·艮陣護法可開啟本卦象，擊殺鳥翔陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 695, bossId = 5627, name = "鳥翔陣·坤卦", explain = "擊殺鳥翔陣·坤陣護法可開啟本卦象，擊殺鳥翔陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 696, bossId = 5628, name = "鳥翔陣·震卦", explain = "擊殺鳥翔陣·震陣護法可開啟本卦象，擊殺鳥翔陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 699, bossId = 5631, name = "鳥翔陣·離卦", explain = "擊殺鳥翔陣·離陣護法可開啟本卦象，擊殺鳥翔陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 701, bossId = 5633, name = "鳥翔陣·兌卦", explain = "擊殺鳥翔陣·兌陣護法可開啟本卦象，擊殺鳥翔陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 716, bossId = 5648, name = "鳥翔陣·陰陽", explain = "擊殺鳥翔陣陣眼可開啟陰陽卦象，開啟鳥翔陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

	[8] =  
 	{
 		[1] = { achieveId = 702, bossId = 5634, name = "蛇蟠陣·乾卦", explain = "擊殺蛇蟠陣·乾陣護法可開啟本卦象，擊殺蛇蟠陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 705, bossId = 5637, name = "蛇蟠陣·巽卦", explain = "擊殺蛇蟠陣·巽陣護法可開啟本卦象，擊殺蛇蟠陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 706, bossId = 5638, name = "蛇蟠陣·坎卦", explain = "擊殺蛇蟠陣·坎陣護法可開啟本卦象，擊殺蛇蟠陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 708, bossId = 5640, name = "蛇蟠陣·艮卦", explain = "擊殺蛇蟠陣·艮陣護法可開啟本卦象，擊殺蛇蟠陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 703, bossId = 5635, name = "蛇蟠陣·坤卦", explain = "擊殺蛇蟠陣·坤陣護法可開啟本卦象，擊殺蛇蟠陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 704, bossId = 5636, name = "蛇蟠陣·震卦", explain = "擊殺蛇蟠陣·震陣護法可開啟本卦象，擊殺蛇蟠陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 707, bossId = 5639, name = "蛇蟠陣·離卦", explain = "擊殺蛇蟠陣·離陣護法可開啟本卦象，擊殺蛇蟠陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 709, bossId = 5641, name = "蛇蟠陣·兌卦", explain = "擊殺蛇蟠陣·兌陣護法可開啟本卦象，擊殺蛇蟠陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 717, bossId = 5649, name = "蛇蟠陣·陰陽", explain = "擊殺蛇蟠陣陣眼可開啟陰陽卦象，開啟蛇蟠陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},
 	
 	[9] =  
 	{
 		[1] = { achieveId = 803, bossId = 7067, name = "天絕陣·乾卦", explain = "擊殺天絕陣·乾陣護法可開啟本卦象，擊殺天絕陣·乾陣金剛·真有機率召喚乾陣護法。", },
		[2] = { achieveId = 806, bossId = 7070, name = "天絕陣·巽卦", explain = "擊殺天絕陣·巽陣護法可開啟本卦象，擊殺天絕陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 807, bossId = 7071, name = "天絕陣·坎卦", explain = "擊殺天絕陣·坎陣護法可開啟本卦象，擊殺天絕陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 809, bossId = 7073, name = "天絕陣·艮卦", explain = "擊殺天絕陣·艮陣護法可開啟本卦象，擊殺天絕陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[5] = { achieveId = 804, bossId = 7068, name = "天絕陣·坤卦", explain = "擊殺天絕陣·坤陣護法可開啟本卦象，擊殺天絕陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 805, bossId = 7069, name = "天絕陣·震卦", explain = "擊殺天絕陣·震陣護法可開啟本卦象，擊殺天絕陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 808, bossId = 7072, name = "天絕陣·離卦", explain = "擊殺天絕陣·離陣護法可開啟本卦象，擊殺天絕陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 810, bossId = 7074, name = "天絕陣·兌卦", explain = "擊殺天絕陣·兌陣護法可開啟本卦象，擊殺天絕陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 867, bossId = 7075, name = "天絕陣·陰陽", explain = "擊殺天絕陣陣眼可開啟陰陽卦象，開啟天絕陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},

 	[10] =  
 	{
 		[1] = { achieveId = 811, bossId = 7078, name = "地烈陣·乾卦", explain = "擊殺地烈陣·乾陣護法可開啟本卦象，擊殺地烈陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 814, bossId = 7087, name = "地烈陣·巽卦", explain = "擊殺地烈陣·巽陣護法可開啟本卦象，擊殺地烈陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 815, bossId = 7090, name = "地烈陣·坎卦", explain = "擊殺地烈陣·坎陣護法可開啟本卦象，擊殺地烈陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 817, bossId = 7096, name = "地烈陣·艮卦", explain = "擊殺地烈陣·艮陣護法可開啟本卦象，擊殺地烈陣·艮陣金剛·真有機率召喚艮陣護法。", },
 		[5] = { achieveId = 812, bossId = 7081, name = "地烈陣·坤卦", explain = "擊殺地烈陣·坤陣護法可開啟本卦象，擊殺地烈陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 813, bossId = 7084, name = "地烈陣·震卦", explain = "擊殺地烈陣·震陣護法可開啟本卦象，擊殺地烈陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 816, bossId = 7093, name = "地烈陣·離卦", explain = "擊殺地烈陣·離陣護法可開啟本卦象，擊殺地烈陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 818, bossId = 7099, name = "地烈陣·兌卦", explain = "擊殺地烈陣·兌陣護法可開啟本卦象，擊殺地烈陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 868, bossId = 7125, name = "地烈陣·陰陽", explain = "擊殺地烈陣陣眼可開啟陰陽卦象，開啟地烈陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},
  	
  	[11] =  
 	{
 		[1] = { achieveId = 819, bossId = 7103, name = "風吼陣·乾卦", explain = "擊殺風吼陣·乾陣護法可開啟本卦象，擊殺風吼陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 822, bossId = 7112, name = "風吼陣·巽卦", explain = "擊殺風吼陣·巽陣護法可開啟本卦象，擊殺風吼陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 823, bossId = 7115, name = "風吼陣·坎卦", explain = "擊殺風吼陣·坎陣護法可開啟本卦象，擊殺風吼陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 825, bossId = 7121, name = "風吼陣·艮卦", explain = "擊殺風吼陣·艮陣護法可開啟本卦象，擊殺風吼陣·艮陣金剛·真有機率召喚艮陣護法。", },
 		[5] = { achieveId = 820, bossId = 7106, name = "風吼陣·坤卦", explain = "擊殺風吼陣·坤陣護法可開啟本卦象，擊殺風吼陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 821, bossId = 7109, name = "風吼陣·震卦", explain = "擊殺風吼陣·震陣護法可開啟本卦象，擊殺風吼陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 824, bossId = 7118, name = "風吼陣·離卦", explain = "擊殺風吼陣·離陣護法可開啟本卦象，擊殺風吼陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 826, bossId = 7124, name = "風吼陣·兌卦", explain = "擊殺風吼陣·兌陣護法可開啟本卦象，擊殺風吼陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 869, bossId = 7126, name = "風吼陣·陰陽", explain = "擊殺風吼陣陣眼可開啟陰陽卦象，開啟風吼陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},	
 
   	[12] =  
 	{
 		[1] = { achieveId = 827, bossId = 7128, name = "寒冰陣·乾卦", explain = "擊殺寒冰陣·乾陣護法可開啟本卦象，擊殺寒冰陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[5] = { achieveId = 828, bossId = 7132, name = "寒冰陣·坤卦", explain = "擊殺寒冰陣·坤陣護法可開啟本卦象，擊殺寒冰陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 829, bossId = 7135, name = "寒冰陣·震卦", explain = "擊殺寒冰陣·震陣護法可開啟本卦象，擊殺寒冰陣·震陣金剛·真有機率召喚震陣護法。", },
		[2] = { achieveId = 830, bossId = 7138, name = "寒冰陣·巽卦", explain = "擊殺寒冰陣·巽陣護法可開啟本卦象，擊殺寒冰陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 831, bossId = 7141, name = "寒冰陣·坎卦", explain = "擊殺寒冰陣·坎陣護法可開啟本卦象，擊殺寒冰陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[7] = { achieveId = 832, bossId = 7144, name = "寒冰陣·離卦", explain = "擊殺寒冰陣·離陣護法可開啟本卦象，擊殺寒冰陣·離陣金剛·真有機率召喚離陣護法。", },
		[4] = { achieveId = 833, bossId = 7147, name = "寒冰陣·艮卦", explain = "擊殺寒冰陣·艮陣護法可開啟本卦象，擊殺寒冰陣·艮陣金剛·真有機率召喚艮陣護法。", },
		[8] = { achieveId = 834, bossId = 7150, name = "寒冰陣·兌卦", explain = "擊殺寒冰陣·兌陣護法可開啟本卦象，擊殺寒冰陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 870, bossId = 7129, name = "寒冰陣·陰陽", explain = "擊殺寒冰陣陣眼可開啟陰陽卦象，開啟寒冰陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},	
 		
    [13] =  
 	{
 		[1] = { achieveId = 835, bossId = 7153, name = "金光陣·乾卦", explain = "擊殺金光陣·乾陣護法可開啟本卦象，擊殺金光陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 838, bossId = 7163, name = "金光陣·巽卦", explain = "擊殺金光陣·巽陣護法可開啟本卦象，擊殺金光陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 839, bossId = 7166, name = "金光陣·坎卦", explain = "擊殺金光陣·坎陣護法可開啟本卦象，擊殺金光陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 841, bossId = 7172, name = "金光陣·艮卦", explain = "擊殺金光陣·艮陣護法可開啟本卦象，擊殺金光陣·艮陣金剛·真有機率召喚艮陣護法。", },
 		[5] = { achieveId = 836, bossId = 7156, name = "金光陣·坤卦", explain = "擊殺金光陣·坤陣護法可開啟本卦象，擊殺金光陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 837, bossId = 7160, name = "金光陣·震卦", explain = "擊殺金光陣·震陣護法可開啟本卦象，擊殺金光陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 840, bossId = 7169, name = "金光陣·離卦", explain = "擊殺金光陣·離陣護法可開啟本卦象，擊殺金光陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 842, bossId = 7175, name = "金光陣·兌卦", explain = "擊殺金光陣·兌陣護法可開啟本卦象，擊殺金光陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 871, bossId = 7157, name = "金光陣·陰陽", explain = "擊殺金光陣陣眼可開啟陰陽卦象，開啟金光陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},	
 
    [14] =  
 	{
 		[1] = { achieveId = 843, bossId = 7178, name = "化血陣·乾卦", explain = "擊殺化血陣·乾陣護法可開啟本卦象，擊殺化血陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 846, bossId = 7188, name = "化血陣·巽卦", explain = "擊殺化血陣·巽陣護法可開啟本卦象，擊殺化血陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 847, bossId = 7191, name = "化血陣·坎卦", explain = "擊殺化血陣·坎陣護法可開啟本卦象，擊殺化血陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 849, bossId = 7197, name = "化血陣·艮卦", explain = "擊殺化血陣·艮陣護法可開啟本卦象，擊殺化血陣·艮陣金剛·真有機率召喚艮陣護法。", },
 		[5] = { achieveId = 844, bossId = 7182, name = "化血陣·坤卦", explain = "擊殺化血陣·坤陣護法可開啟本卦象，擊殺化血陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 845, bossId = 7185, name = "化血陣·震卦", explain = "擊殺化血陣·震陣護法可開啟本卦象，擊殺化血陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 848, bossId = 7194, name = "化血陣·離卦", explain = "擊殺化血陣·離陣護法可開啟本卦象，擊殺化血陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 850, bossId = 7200, name = "化血陣·兌卦", explain = "擊殺化血陣·兌陣護法可開啟本卦象，擊殺化血陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 872, bossId = 7179, name = "化血陣·陰陽", explain = "擊殺化血陣陣眼可開啟陰陽卦象，開啟化血陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},
 	
    [15] =  
 	{
 		[1] = { achieveId = 851, bossId = 7203, name = "落魂陣·乾卦", explain = "擊殺落魂陣·乾陣護法可開啟本卦象，擊殺落魂陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 854, bossId = 7212, name = "落魂陣·巽卦", explain = "擊殺落魂陣·巽陣護法可開啟本卦象，擊殺落魂陣·巽陣金剛·真有機率召喚巽陣護法。", },
 		[3] = { achieveId = 855, bossId = 7215, name = "落魂陣·坎卦", explain = "擊殺落魂陣·坎陣護法可開啟本卦象，擊殺落魂陣·坎陣金剛·真有機率召喚坎陣護法。", },
 		[4] = { achieveId = 857, bossId = 7221, name = "落魂陣·艮卦", explain = "擊殺落魂陣·艮陣護法可開啟本卦象，擊殺落魂陣·艮陣金剛·真有機率召喚艮陣護法。", },
 		[5] = { achieveId = 852, bossId = 7206, name = "落魂陣·坤卦", explain = "擊殺落魂陣·坤陣護法可開啟本卦象，擊殺落魂陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 853, bossId = 7209, name = "落魂陣·震卦", explain = "擊殺落魂陣·震陣護法可開啟本卦象，擊殺落魂陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 856, bossId = 7218, name = "落魂陣·離卦", explain = "擊殺落魂陣·離陣護法可開啟本卦象，擊殺落魂陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 858, bossId = 7224, name = "落魂陣·兌卦", explain = "擊殺落魂陣·兌陣護法可開啟本卦象，擊殺落魂陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 873, bossId = 7225, name = "落魂陣·陰陽", explain = "擊殺落魂陣陣眼可開啟陰陽卦象，開啟落魂陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},	
 
    [16] =  
 	{
 		[1] = { achieveId = 859, bossId = 7228, name = "紅沙陣·乾卦", explain = "擊殺紅沙陣·乾陣護法可開啟本卦象，擊殺紅沙陣·乾陣金剛·真有機率召喚乾陣護法。", },
 		[2] = { achieveId = 862, bossId = 7237, name = "紅沙陣·巽卦", explain = "擊殺紅沙陣·巽陣護法可開啟本卦象，擊殺紅沙陣·巽陣金剛·真有機率召喚巽陣護法。", },
		[3] = { achieveId = 863, bossId = 7240, name = "紅沙陣·坎卦", explain = "擊殺紅沙陣·坎陣護法可開啟本卦象，擊殺紅沙陣·坎陣金剛·真有機率召喚坎陣護法。", },
		[4] = { achieveId = 865, bossId = 7246, name = "紅沙陣·艮卦", explain = "擊殺紅沙陣·艮陣護法可開啟本卦象，擊殺紅沙陣·艮陣金剛·真有機率召喚艮陣護法。", },
 		[5] = { achieveId = 860, bossId = 7231, name = "紅沙陣·坤卦", explain = "擊殺紅沙陣·坤陣護法可開啟本卦象，擊殺紅沙陣·坤陣金剛·真有機率召喚坤陣護法。", },
		[6] = { achieveId = 861, bossId = 7234, name = "紅沙陣·震卦", explain = "擊殺紅沙陣·震陣護法可開啟本卦象，擊殺紅沙陣·震陣金剛·真有機率召喚震陣護法。", },
		[7] = { achieveId = 864, bossId = 7243, name = "紅沙陣·離卦", explain = "擊殺紅沙陣·離陣護法可開啟本卦象，擊殺紅沙陣·離陣金剛·真有機率召喚離陣護法。", },
		[8] = { achieveId = 866, bossId = 7249, name = "紅沙陣·兌卦", explain = "擊殺紅沙陣·兌陣護法可開啟本卦象，擊殺紅沙陣·兌陣金剛·真有機率召喚兌陣護法。", },
		[9] = { achieveId = 874, bossId = 7250, name = "紅沙陣·陰陽", explain = "擊殺紅沙陣陣眼可開啟陰陽卦象，開啟紅沙陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},
 	[17] =  
 	{
 		[1] = { achieveId = 1021, bossId = 12429, name = "六合陣·乾卦", explain = "擊殺六合陣·乾陣護法可啟動本卦象，擊殺六合陣·乾陣金剛·真有幾率召喚乾陣護法。", },
 		[2] = { achieveId = 1024, bossId = 12432, name = "六合陣·巽卦", explain = "擊殺六合陣·巽陣護法可啟動本卦象，擊殺六合陣·巽陣金剛·真有幾率召喚巽陣護法。", },
		[3] = { achieveId = 1025, bossId = 12433, name = "六合陣·坎卦", explain = "擊殺六合陣·坎陣護法可啟動本卦象，擊殺六合陣·坎陣金剛·真有幾率召喚坎陣護法。", },
		[4] = { achieveId = 1027, bossId = 12435, name = "六合陣·艮卦", explain = "擊殺六合陣·艮陣護法可啟動本卦象，擊殺六合陣·艮陣金剛·真有幾率召喚艮陣護法。", },
		[5] = { achieveId = 1022, bossId = 12430, name = "六合陣·坤卦", explain = "擊殺六合陣·坤陣護法可啟動本卦象，擊殺六合陣·坤陣金剛·真有幾率召喚坤陣護法。", },
		[6] = { achieveId = 1023, bossId = 12431, name = "六合陣·震卦", explain = "擊殺六合陣·震陣護法可啟動本卦象，擊殺六合陣·震陣金剛·真有幾率召喚震陣護法。", },
		[7] = { achieveId = 1026, bossId = 12434, name = "六合陣·離卦", explain = "擊殺六合陣·離陣護法可啟動本卦象，擊殺六合陣·離陣金剛·真有幾率召喚離陣護法。", },
		[8] = { achieveId = 1028, bossId = 12436, name = "六合陣·兌卦", explain = "擊殺六合陣·兌陣護法可啟動本卦象，擊殺六合陣·兌陣金剛·真有幾率召喚兌陣護法。", },
		[9] = { achieveId = 1029, bossId = 12437, name = "六合陣·陰陽", explain = "擊殺六合陣陣眼可啟動陰陽卦象，啟動六合陣八個卦象後進入八陣圖即可召喚陣眼。", },
 	},	
}


return eightBlast