local LotteryScratchConfig = {}
--刮刮彩类型一
LotteryScratchConfig[1] = 
{
	-- 总共有多少个图标 pathid 
		[1] = 3233,
		[2] = 3234,
		[3] = 3235,
		[4] = 3236,
		[5] = 3301,
		[6] = 3364,
		[7] = 3251,
		[8] = 3254,
		[9] = 3256,
		[10] = 3257,
}
--刮刮彩类型二 数字字符类型 显示数字 
LotteryScratchConfig[2] = 
{
	[1] = 1,
	[2] = 2,
	[3] = 3,
	[4] = 4,
	[5] = 5,
	[6] = 6,
	[7] = 7,
	[8] = 8,
	[9] = 9,
	[10] = 10,
	[11] = 11,
	[12] = 12,
	[13] = 13,
	[14] = 14,
	[15] = 15,
	[16] = 16,
	[17] = 17,
	[18] = 18,
	[19] = 19,
	[20] = 20,
	[21] = 21,
	[22] = 22,
	[23] = 23,
	[24] = 24,
	[25] = 25,
}

--刮刮彩类型三 
LotteryScratchConfig[3] = 
{
	[1] = "六龍",
	[2] = "爭霸",
	[3] = "千人",
	[4] = "國戰",
}

--刮刮彩类型四
LotteryScratchConfig[4] = 
{
	[1] = "六",
	[2] = "龍",
	[3] = "爭",
	[4] = "霸",
}

--随机奖励数组 钻石数量
local LotteryRewardConfig = 
{
	[1] = 20,
	[2] = 50,
	[3] = 100,
	[4] = 200,
	[5] = 500,
	[6] = 1000,
	[7] = 2000,
	[8] = 5000,
	[9] = 10000,
	[10] = 20000,
	[11] = 50000,
	[12] = 100000,
}

return { 
	LotteryScratchConfig = LotteryScratchConfig,
	LotteryRewardConfig = LotteryRewardConfig,
	}