--杂项配置

--限时抢购配置
local LimitTimeBuy =
{
	idList = {5221,5222,5288,6435,6436,6437,6438,6439,6440},
	-- [5215] = 
	-- {
	-- 	title = "限时抢购<5215>",
	-- 	desc = "赶紧购买限时抢购<5215>",
	-- 	originPrice = 1, --原始价格 --可以不配
	-- },
	[5221] = 
	{
		title = "限時搶購",
		desc = "購買即可開啟更優惠搶購",
		originPrice = 1088, --原始价格 --可以不配
	},
	[5222] = 
	{
		title = "進階搶購",
		desc = "助將軍快速提升戰力！",
		originPrice = 4288, --原始价格 --可以不配
	},
	[5288] =
	{
		title = "榮譽限時搶",
		desc = "助將軍快速提升技能！",
		originPrice = 666, --原始价格 --可以不配
	},
	
	[6435] = 
	{
		title = "馬草限時搶購",
		desc = "購買即可開啟更優惠搶購",
		originPrice = 888, --原始价格 --可以不配
	},
	[6436] = 
	{
		title = "馬草進階搶購",
		desc = "助將軍快速提升戰力！",
		originPrice = 4500, --原始价格 --可以不配
	},	
	
	[6437] = 
	{
		title = "天賦限時搶購",
		desc = "購買即可開啟更優惠搶購",
		originPrice = 1688, --原始价格 --可以不配
	},
	[6438] = 
	{
		title = "天賦進階搶購",
		desc = "助將軍快速提升戰力！",
		originPrice = 6000, --原始价格 --可以不配
	},	

	[6439] = 
	{
		title = "戰力限時搶購",
		desc = "購買即可開啟更優惠搶購",
		originPrice = 7999, --原始价格 --可以不配
	},
	[6440] = 
	{
		title = "戰力進階搶購",
		desc = "助將軍快速提升戰力！",
		originPrice = 42000, --原始价格 --可以不配
	},	
	
}

--神兽装备开启等级
local PetEquipUnlockLv = 
{
	["ring"] = 58,
	["neck"] = 62,
	["glove"] = 66,
}

------------------------------------------
-- 排行奖励
-- name:	所有"1V1竞技排行"这类页签必须按LIMIT_ARENA1-n命名
-- 			比如"LIMIT_ARENA11"表示第4季3V3竞技排行, 其余的名字随意起
-- buttonName:	一定要按顺序加
local RewardPayRankList = 
{
	[1] = --中秋节
	{
		name = "MID_MOON_RANK_LIST",--活动进行时维持7天的榜单
		buttonName = "Rtn_RankingList25",
		rank_reward_tid = 5774
	},
	--国庆节
	[2] = 
	{
		name = "WAR_COUNTRY_LIST",--国庆活动国家排行榜
		buttonName = "Rtn_RankingList26",
		description = "貢獻度到達100的玩家可按照排名領取相應獎勵",
		rank_reward_tid = 5988
	},
	[3] = 
	{
		name = "WAR_PERSONAL_LIST",--国庆活动个人排行榜
		buttonName = "Rtn_RankingList27",
		description = "貢獻度到達100的玩家可按照排名領取相應獎勵",
		rank_reward_tid = 5987
	},
	[4] = 
	{
		name = "WAR_THANKSGIVINGDAY_LIST",--感恩节排行榜
		buttonName = "Rtn_RankingList28",
		rank_reward_tid = 6768  --排行榜奖励配置ID
	},
	[5] = --每月送花排行榜（一生所爱）
	{
		name = "MONTH_FLOWER_PAY",
		buttonName = "Rtn_RankingList29",
		rank_reward_tid = 7344
	},
	[6] = --每月收花排行榜（爱是永恒）
	{
		name = "MONTH_FLOWER_GET",
		buttonName = "Rtn_RankingList30",
		rank_reward_tid = 7345
	},
	[7] = --国镖捐献榜
	{
		name = "NATIONAL_CAR_LIST",--国镖捐献榜
		buttonName = "Rtn_RankingList31",
		rank_reward_tid = 7302
	},
	[8] = --七夕鹊桥会
	{
		name = "QIXI_MEET_LIST",--七夕鹊桥会
		buttonName = "Rtn_RankingList32",
		rank_reward_tid = 12235
	},
	
	[9] = --蓝色妖姬情人节收花
	{
		name = "MONTH_FLOWERBLUE_GET",
		buttonName = "Rtn_RankingList33",
		rank_reward_tid = 13514
	},
	[10] = --蓝色妖姬情人节送花
	{
		name = "MONTH_FLOWERBLUE_PAY",
		buttonName = "Rtn_RankingList34",
		rank_reward_tid = 13515
	},
	[11] = --双十一贡献
	{
		name = "DOUBLE_ELEVEN_LIST",
		buttonName = "Rtn_RankingList35",
		rank_reward_tid = 15404
	},
	[12] = --演武积分
	{
		name = "YANWU_RANK_LIST",
		buttonName = "Rtn_RankingList36",
		rank_reward_tid = 18910
	},
}
------------------------------------------
-- 1. 刀客, 2. 枪客, 3. 法师, 4. 弓箭手, 5. 锤, 6.扇 , 7. 枪盾
local _weapon_offset =
{
	[1] = 
	{ 
		right = 
		{
			pos = { x = -0.4139, y = -0.1204, z = -0.2236 },  angle = { x = 8.65, y = 68.39, z = 5.04 } 
		}
	},
	[2] = 
	{ 
		right = 
		{
			pos = { x = -0.1998, y = -0.1619, z = 0.1081 },    angle = { x = 0.00, y = -51.99, z = 0 } 
		}
	},
	[3] = 
	{ 
		right = 
		{
			pos = { x = -0.0615, y = -0.1719, z = 0.0 },      angle = { x = 0, y = -51.99, z = 0 }
		}
	},
	[4] = 
	{ 
		right = 
		{
			pos = { x = -0.0928, y = -0.1794, z = -0.0465 },  angle = { x = -1.90, y = -51.50, z = -14.57 }
		}
	},
	[5] = 
	{ 
		right = 
		{
			pos = { x = -0.0928, y = -0.1794, z = -0.0465 },  angle = { x = -1.90, y = -51.50, z = -14.57 }
		}
	},
	[6] = 
	{ 
		right = 
		{
			pos = { x = -0.0270, y = -0.1840, z = -0.080 },  angle = { x = -1.95, y = -50.30, z = 165.84 }
		}
	},
	[7] = 
	{ 
		left =
		{
			pos = { x = -0.0978, y = -0.2432, z = 0.0035 },    angle = { x = 13.32, y = 117.14, z = 23.55 }
		},
		right = 
		{
			pos = { x = -0.288, y = -0.114, z = -0.108 },    angle = { x = -13.00128, y = -125.0587, z = 179.5046 }
		}
	},
}
------------------------------------------
--卡牌预览集合
local CardPreviewList = 
{
	--三国
	[1] =
	{
		14612
,14613
,14614
,14615
,14616
,14617
,14618
,14619
,14620
,14621
,14622
,14623
,14624
,14625
,14626
,14627
,14628
,14629
,14630
,14631
,14632
,14633
,7653
,7654
,7655
,1554
,1555
,1556
,1557
,1558
,1559
,1560
,1561
,1562
,1563
,1564
,1565
,1566
,1567
,1568
,1569
,1570
,1571
,1572
,1573
,1574
,1575
,1576
,1577
,1578
,1579
,1580
,1581
,1582
,1583
,1584
,1585
,1586
,1587
,1588
,1589
,1590
,1591
,1592
,1593
,1594
,1595
,1596
,1597
,1598
,1599
,1600
,1601
,1602
,1603
,1604
,1605
,1606
,1607
,1608
,1609
,1610
,1611
,1612
,1613
,1614
,1616
,1619
,1620
,1623
,1624
,1625
,1626
,1627
,1628
,1629
,1630
,1631
,1635
,1636
,1637
,1642
,1643
,1644
,1647
,1648
,1649
,1650
,1651
,1652
,1653
,1654



	},

	--东周
	[2] =
	{
		9222,9223,9224,9225,9226,9227,9228,9229,9230,9231,9232,9233,9234,9235,9236,9237,9239,9240,9241,9242,9479,9480,9481,9482,9483,9484,9485,9486,9487,9488,9489,9490,9491,9492,9493,9494,9495,9496,9497,9498,9499,9500,9501,9502,9503,9504,9505,9506,9507,9508,9509,9510,9511
,9512
,9513
,9514
,9515
,9516
,9517
,9518
,9519
,9520
,9521
,9522
,9523
,9524
,9525
,9526
,9527
,9528
,9529
,9530
,9531
,9532
,9533
,9534
,9535
,9536
,9537
,9538
,9539
,9540
,9541
,9542
,9543
,9544
,9545
,9546
,9547
,9548
,9549
,9550
,9551
,9552
,9553
,9554
,9555
,9556
,9557
,9558
,9559
,9560
,9561
,9562
,9563
,9564
,9565
,9566
,9567
,9568
,9569
,9570
,9571
,9572
,9573
,9574
,9575
,9576
,9577
,9578

        },
}
------------------------------------------

return 
{
	LimitTimeBuy = LimitTimeBuy,
	PetEquipUnlockLv = PetEquipUnlockLv,
	RewardPayRankList = RewardPayRankList,
	_weapon_offset = _weapon_offset,
	CardPreviewList = CardPreviewList,
}