-- secrets.lua
--秘籍系统配置文件 

local ConfigID = 9508 --秘籍系统配置文件

local Secret_CostItem_Tid = 17246 --消耗物品ID
local Main_Page_ItemNum = 8   --每页显示秘籍数量
local Main_Rdo_Distance = 30  --分页按钮之间距离
local Main_Page_Width = 840   --每页的区域宽度
local Chapter_Page_ItemNum = 1  --每页显示章节数量
local Chapter_Rdo_Distance = 30  --分页按钮之间距离
local Chapter_Page_Width = 538   --每页的区域宽度


--心法描述配置
local XinFa_Desc = {}
--神农本草
XinFa_Desc[10255] = 
{
	desc = "",
	[0] = "未習得",
	[1] = "生命低於30%時，回復自身20%生命，此效果每隔90秒觸發一次",

}
XinFa_Desc[10843] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身20%生命，此效果每隔90秒觸發一次",
	[1] = "生命低於30%時，回復自身25%生命，此效果每隔85秒觸發一次",
}
XinFa_Desc[10844] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身25%生命，此效果每隔85秒觸發一次",
	[1] = "生命低於30%時，回復自身30%生命，此效果每隔80秒觸發一次",
}
XinFa_Desc[10845] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身30%生命，此效果每隔80秒觸發一次",
	[1] = "生命低於30%時，回復自身35%生命，此效果每隔75秒觸發一次",
}
XinFa_Desc[10846] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身35%生命，此效果每隔75秒觸發一次",
	[1] = "生命低於30%時，回復自身40%生命，此效果每隔70秒觸發一次",
}

XinFa_Desc[10847] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身40%生命，此效果每隔70秒觸發一次",
	[1] = "生命低於30%時，回復自身45%生命，此效果每隔65秒觸發一次",
}
XinFa_Desc[10848] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身45%生命，此效果每隔65秒觸發一次",
	[1] = "生命低於30%時，回復自身50%生命，此效果每隔60秒觸發一次",
}
XinFa_Desc[10849] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身50%生命，此效果每隔60秒觸發一次",
	[1] = "生命低於30%時，回復自身55%生命，此效果每隔55秒觸發一次",
}
XinFa_Desc[10850] = 
{
	desc = "",
	[0] = "生命低於30%時，回復自身55%生命，此效果每隔55秒觸發一次",
	[1] = "生命低於30%時，回復自身60%生命，此效果每隔50秒觸發一次",
}
--孟德新书
XinFa_Desc[10893] = 
{
	desc = "",
	[0] = "未習得",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔120秒觸發一次",

}
XinFa_Desc[10894] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔120秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔115秒觸發一次",

}
XinFa_Desc[10895] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔115秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔110秒觸發一次",

}
XinFa_Desc[10896] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔110秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔105秒觸發一次",

}
XinFa_Desc[10897] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔105秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔100秒觸發一次",

}
XinFa_Desc[10898] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔100秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔95秒觸發一次",
	
}
XinFa_Desc[10899] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔95秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔90秒觸發一次",
	
}
XinFa_Desc[10900] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔90秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔85秒觸發一次",
	
}
XinFa_Desc[10901] = 
{
	desc = "",
	[0] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔85秒觸發一次",
	[1] = "擊敗敵方玩家時，清空所有技能冷卻，此效果每隔70秒觸發一次",
	
}
--孙子兵法
XinFa_Desc[10902] = 
{
	desc = "",
	[0] = "未習得",
	[1] = "暴擊時，3秒內增加自身當前10%攻擊力，此效果每隔40秒觸發一次",
	
}
XinFa_Desc[10903] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前10%攻擊力，此效果每隔40秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前11%攻擊力，此效果每隔37秒觸發一次",
	
}
XinFa_Desc[10904] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前11%攻擊力，此效果每隔37秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前12%攻擊力，此效果每隔34秒觸發一次",
	
}
XinFa_Desc[10905] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前12%攻擊力，此效果每隔34秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前13%攻擊力，此效果每隔31秒觸發一次",
	
}
XinFa_Desc[10906] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前13%攻擊力，此效果每隔31秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前14%攻擊力，此效果每隔28秒觸發一次",
	
}
XinFa_Desc[10907] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前14%攻擊力，此效果每隔28秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前15%攻擊力，此效果每隔25秒觸發一次",
	
}
XinFa_Desc[10908] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前15%攻擊力，此效果每隔25秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前16%攻擊力，此效果每隔22秒觸發一次",
	
}
XinFa_Desc[10909] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前16%攻擊力，此效果每隔22秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前17%攻擊力，此效果每隔19秒觸發一次",
	
}
XinFa_Desc[10910] = 
{
	desc = "",
	[0] = "暴擊時，3秒內增加自身當前17%攻擊力，此效果每隔19秒觸發一次",
	[1] = "暴擊時，3秒內增加自身當前20%攻擊力，此效果每隔15秒觸發一次",
	
}
--鬼谷子
XinFa_Desc[10911] = 
{
	desc = "",
	[0] = "未習得",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔150秒觸發一次",
	
}
XinFa_Desc[10912] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔150秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔140秒觸發一次",
	
}
XinFa_Desc[10913] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔140秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔130秒觸發一次",
	
}
XinFa_Desc[10914] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔130秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔120秒觸發一次",
	
}
XinFa_Desc[10915] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔120秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔110秒觸發一次",
	
}
XinFa_Desc[10916] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔110秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔100秒觸發一次",
	
}
XinFa_Desc[10917] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔100秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔90秒觸發一次",
	
}
XinFa_Desc[10918] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔90秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔80秒觸發一次",
	
}
XinFa_Desc[10919] = 
{
	desc = "",
	[0] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔80秒觸發一次",
	[1] = "被控制時，立即解除控制狀態並在接下來3秒內免疫控制，此效果每隔60秒觸發一次",
	
}
--八阵总述
XinFa_Desc[10920] = 
{
	desc = "",
	[0] = "未習得",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔120秒觸發一次",
	
}
XinFa_Desc[10921] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔120秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔110秒觸發一次",
	
}
XinFa_Desc[10922] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔110秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔100秒觸發一次",
	
}
XinFa_Desc[10923] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔100秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔90秒觸發一次",
	
}
XinFa_Desc[10924] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔90秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔80秒觸發一次",
	
}
XinFa_Desc[10925] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔80秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔70秒觸發一次",
	
}
XinFa_Desc[10926] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔70秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔60秒觸發一次",
	
}
XinFa_Desc[10927] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔60秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔50秒觸發一次",
	
}
XinFa_Desc[10928] = 
{
	desc = "",
	[0] = "生命低於50%時，增加50%傷害減免，此效果每隔50秒觸發一次",
	[1] = "生命低於50%時，增加50%傷害減免，此效果每隔40秒觸發一次",
	
}

XinFa_Desc[10763] = 
{
	desc = "測試心法5：您剛剛在遊戲中產生了一筆消費，但因為網路原因未能及時扣除您的鑽石，本次消費已記錄，會在隨後扣除您%d鑽石，如有疑問請及時與客服聯繫。",
	[0] = "測試心法5：未習得",
	[1] = "測試心法5：技能等級1",
	[2] = "測試心法5：技能等級2",
	[3] = "測試心法5：技能等級3",
	[4] = "測試心法5：技能等級4",
	[5] = "測試心法5：技能等級5",
}
local Fx_XinFa = 
{
	Fx_Name=
	{
		[1] = {
			[1] = RESPATH.fx_ui_Foreground_blue_01,
			[2] = RESPATH.fx_ui_Foreground_blue_02,
			[3] = RESPATH.fx_ui_Foreground_blue_03,
			[4] = RESPATH.fx_ui_Foreground_blue_04,
			[5] = RESPATH.fx_ui_Foreground_blue_05,
			[100] = RESPATH.fx_ui_Foreground_blue_all,
		},
		[2] = {
			[1] = RESPATH.fx_ui_Foreground_greed_01,
			[2] = RESPATH.fx_ui_Foreground_greed_02,
			[3] = RESPATH.fx_ui_Foreground_greed_03,
			[4] = RESPATH.fx_ui_Foreground_greed_04,
			[5] = RESPATH.fx_ui_Foreground_greed_05,
			[100] = RESPATH.fx_ui_Foreground_greed_all,
		},
		[3] = {
			[1] = RESPATH.fx_ui_Foreground_orange_01,
			[2] = RESPATH.fx_ui_Foreground_orange_02,
			[3] = RESPATH.fx_ui_Foreground_orange_03,
			[4] = RESPATH.fx_ui_Foreground_orange_04,
			[5] = RESPATH.fx_ui_Foreground_orange_05,
			[100] = RESPATH.fx_ui_Foreground_orange_all,
		},
		[4] = {
			[1] = RESPATH.fx_ui_Foreground_purple_01,
			[2] = RESPATH.fx_ui_Foreground_purple_02,
			[3] = RESPATH.fx_ui_Foreground_purple_03,
			[4] = RESPATH.fx_ui_Foreground_purple_04,
			[5] = RESPATH.fx_ui_Foreground_purple_05,
			[100] = RESPATH.fx_ui_Foreground_purple_all,
		},
		[5] = {
			[1] = RESPATH.fx_ui_Foreground_red_01,
			[2] = RESPATH.fx_ui_Foreground_red_02,
			[3] = RESPATH.fx_ui_Foreground_red_03,
			[4] = RESPATH.fx_ui_Foreground_red_04,
			[5] = RESPATH.fx_ui_Foreground_red_05,
			[100] = RESPATH.fx_ui_Foreground_red_all,
		}, 
		[6] = {
			[1] = RESPATH.fx_ui_Foreground_yellow_01,
			[2] = RESPATH.fx_ui_Foreground_yellow_02,
			[3] = RESPATH.fx_ui_Foreground_yellow_03,
			[4] = RESPATH.fx_ui_Foreground_yellow_04,
			[5] = RESPATH.fx_ui_Foreground_yellow_05,
			[100] = RESPATH.fx_ui_Foreground_yellow_all,
		}, 
		special_unlock = RESPATH.fx_ui_Foreground_all,
	},
	XinFa_Icon_FX_Name = 
	{
	--1 蓝色，2 绿色 ，3 橙色 ，4 紫色， 5 红色，6 黄色。
		[3592] = 5, --红色
		[3593] = 2, --绿色
		[2973] = 2,
		[3076] = 2,
		[2974] = 6, --黄色
		[3077] = 6,
		[3594] = 6,
		[2975] = 4,--紫色
		[3078] = 4,
		[3591] = 4,
		[2976] = 1,
		[3079] = 1,

		[4959] = 5,
		[4960] = 1,
		[4961] = 1,
		[4962] = 2,
		[4959] = 3,
		[5684] = 3,
	},

}
return {
	ConfigID = ConfigID,
	Secret_CostItem_Tid = Secret_CostItem_Tid,
	Main_Page_ItemNum = Main_Page_ItemNum,
	Main_Rdo_Distance = Main_Rdo_Distance,
	Main_Page_Width = Main_Page_Width,
	Chapter_Page_ItemNum = Chapter_Page_ItemNum,
	Chapter_Rdo_Distance = Chapter_Rdo_Distance,
	Chapter_Page_Width = Chapter_Page_Width,
	XinFa_Desc = XinFa_Desc,
	Fx_XinFa = Fx_XinFa,
}

