
-- server_war_cfg.lua

local hero_event = 
{
	[1] = "[ffffff]%s國%s[-]成功擊破外城大門，長驅直入殺出一條血路！",
	[2] = "[ffffff]%s國%s[-]鳴起戰鼓，拉響了戰鬥的序幕！",
	[3] = "[ffffff]%s國%s[-]成功奪下右丞相的玉令，所在陣營攻擊提升！",
	[4] = "[ffffff]%s國%s[-]成功奪下左丞相的玉令，所在陣營生命提升！",
	[5] = "[ffffff]%s國%s[-]擊殺了假丞相，將假丞相的陰謀公之於眾！",
	[6] = "[ffffff]%s國%s[-]將西門守將斬于馬下！",
	[7] = "[ffffff]%s國%s[-]一舉擊敗中門守將！",
	[8] = "[ffffff]%s國%s[-]使南門守將俯首稱臣！",
	[9] = "[ffffff]%s國%s[-]成功佔領了龍椅，為所在陣營增加大量士氣！",
	[10] = "[ffffff]%s國%s[-]發動玄氣炮，對敵方造成大量法術傷害！",
	[11] = "[ffffff]%s國%s[-]發動金鋼炮，對敵方造成大量物理傷害！",
	[12] = "[ffffff]%s國%s[-]巧用計謀，成功打通了城西密道！",
	[13] = "[ffffff]%s國%s[-]機敏聰慧，成功打通了城南密道！",

}

return {
	hero_event = hero_event,
}

