
--待机状态战斗规则

local standby_fight_rule = standby_fight_rule or {}

--待机时间单位秒
standby_fight_rule.standbytime = 6


--使用待机规则的副本
standby_fight_rule.instance = 
{		
	[524] = true,              --名将试炼
	[522] = true,              --山神庙
	[523] = true,              --神秘栈道
        [525] = true,              --擂台
	[839] = true,              --闯天关
	[884] = true,              --长板桥1
	[965] = true,              --长板桥2
	[966] = true,              --长板桥3
	[883] = true,              --藏金窟1
	[963] = true,              --藏金窟2
	[964] = true,              --藏金窟3
        [885] = true,              --剧情本1
	[886] = true,              --剧情本2
	[887] = true,              --剧情本3
	[888] = true,              --剧情本4
	[889] = true,              --剧情本5
	[890] = true,              --剧情本6
	[891] = true,              --剧情本7
	[892] = true,              --剧情本8
	[893] = true,              --剧情本9
	[894] = true,              --剧情本10
        [828] = true,              --皇陵偏殿1
	[958] = true,              --皇陵偏殿2
	[959] = true,              --皇陵偏殿3
	[960] = true,              --皇陵偏殿4
	[961] = true,              --皇陵偏殿5
	[829] = true,              --皇陵密室1
	[962] = true,              --皇陵密室2
	[967] = true,              --皇陵密室3
	[968] = true,              --皇陵密室4
	[830] = true,              --皇陵宝库1
        [969] = true,              --皇陵宝库2
	[970] = true,              --皇陵宝库3
	[971] = true,              --皇陵宝库4
	[972] = true,              --皇陵宝库5
        [2133]= true,              --组队副本01皇陵1f
	[2134]= true,              --组队副本01皇陵1g
	[2135]= true,              --组队副本02皇陵1f
	[2136]= true,              --组队副本02皇陵1g
	[2137]= true,              --组队副本03皇陵1f
	[2138]= true,              --组队副本03皇陵1g
	[2139]= true,              --90级藏金库
	[2140]= true,              --80级长板桥
        [2088]= true,              --剧情本11
	[2089]= true,              --剧情本12
	[2090]= true,              --剧情本13
	[2091]= true,              --剧情本14

	[3102]= true,				--精英扫荡
	[5281]= true,				--坐骑炼星副本
}


return standby_fight_rule

