
local WineGameConfig = {}

local configInstance = {}

function WineGameConfig:getAllConfigs ()
	return configInstance
end

function WineGameConfig:getStatusDesc ()
	local status = 
	{
		"[-][09fb29]神采飛揚",	--状态1
		"[-][98ff29]酒至微醺",	--状态2
		"[-][ffd800]面紅耳赤",	--状态3
		"[-][ff8e00]酩酊大醉",	--状态4
		"[-][ff4500]爛醉如泥",	--状态5
		"[-][ff0000]不省人事",	--状态6
	}
	return status
end

function WineGameConfig:addConfig(config)
	if config and config.status_encode > 0 then
		configInstance[config.status_encode] = config
	end
end

WineGameConfig:addConfig
{
	status_encode = 11,
	desc = 
	{
		"“今天喝不夠，咱倆都別走！”%s忿忿地自罰一缸。",
		"“今天喝不夠，咱倆都別走！”你忿忿地自罰一缸。",
		"“感情深，一口悶！”你和%s把酒言歡。",
		"“今天喝不夠，咱倆都別走！”你灌了%s兩缸。",
		"“今天喝不夠，咱倆都別走！”你反被%s灌了一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 12,
	desc = 
	{
		"“兄弟！喝酒上臉啊！”%s喝了這缸酒，已經酒至微醺。",
		"“兄弟！喝酒上臉啊！”你看看%s，一口悶了一缸。",
		"“不幹這碗酒，枉在世上走！”你豪情萬丈，%s已經有點面紅。",
		"你掏出了一把卓越.開山刀，架在%s脖子上，灌了他兩缸。",
		"你剛剛掏出卓越.開山刀，就被%s空手奪白刃，反被灌一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 13,
	desc = 
	{
		"“我比王城車夫高的多！”喝了這缸酒，%s已經開始胡言亂語。",
		"“我比王城車夫高的多！”你沒管胡言亂語的%s，自己喝下了一缸。",
		"“這缸好酒不乾爽，抽卡只出鮑三娘！”又幹一缸，%s似乎已經有點不支。",
		"“我比王城車夫。。。唔“%s還沒說完，就被你灌了兩缸酒。",
		"“我還沒醉！”面紅耳赤的%s奪過你的酒灌到了你嘴裡。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 14,
	desc = 
	{
		"“五魁首啊六六六！喝！”快支援不住的%s又喝一缸。",
		"“五魁首啊六六六！喝！”你運氣不佳，喝下一缸。",
		"“想要感情有，就得多喝酒！”你非常亢奮地和%s又乾了一缸。",
		"“其實我是六龍的策劃隔壁老王。。。唔”%s還沒說完又被你灌了幾缸。",
		"“我不喝我不喝！”%s頑強抵抗，你只好自罰一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 15,
	desc = 
	{
		"“我們那個狗皇帝就知道禁言！”再喝一缸的%s已經爛醉如泥了。",
		"看著爛醉如泥的%s，你自顧喝下了一缸。",
		"“我們那個狗皇帝就知道禁言！”乾了這一缸，%s已經爛醉如泥了。",
		"“我們那個狗皇帝就知道禁言！”%s在罵的同時，又被灌了兩缸。",
		"“休想再灌我！”爛醉的%s果斷反擊，灌了你一缸",
	},
}

WineGameConfig:addConfig
{
	status_encode = 16,
	desc = 
	{
		"你輕鬆灌倒了%s，攜財寶揚長而去。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 21,
	desc = 
	{
		"“兄弟！喝酒上臉啊！”%s看看你，一口悶了一缸。",
		"“兄弟！喝酒上臉啊！”你喝了這缸酒，已經酒至微醺。",
		"“不幹這碗酒，枉在世上走！”%s豪情萬丈，你已經有點面紅。",
		"你掏出了一把卓越.開山刀，架在%s脖子上，灌了他兩缸。",
		"你剛剛掏出卓越.開山刀，就被%s空手奪白刃，反灌一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 22,
	desc = 
	{
		"“好酒，好酒，哈哈哈！”%s又喝了一缸。",
		"“好酒，好酒，哈哈哈！”你又喝了一缸。",
		"“今天我們不醉不歸！”你和%s擼起了時裝的袖子，準備開始大喝一頓。",
		"“不用灌！我自己來！”%s自己喝下了兩缸。",
		"“兄弟我可還沒醉！”%s反手給你灌了一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 23,
	desc = 
	{
		"“酒逢知己千杯少，能喝多少喝多少！”%s又喝了一缸。",
		"“酒逢知己千杯少，能喝多少喝多少！”你又喝了一缸。",
		"“酒逢知己千杯少，能喝多少喝多少！幹！”酒過三巡，你和%s漸入佳境。",
		"“我有一百種方法灌醉你，可你，卻無可奈何。”你成功灌了%s兩缸酒。",
		"“我有一百種方法灌。。。”“啪！”你還沒說完，被%s扇了一耳光，順帶灌了一缸酒。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 24,
	desc = 
	{
		"“哥倆好啊三星照！喝！”%s艱難地又喝一缸。",
		"“哥倆好啊三星照！喝！”你輕鬆喝一缸。",
		"“今天拼酒拼不贏，名將五連黃月英！”乾了這缸的%s已然大醉，卻仍在苦苦支撐。",
		"“別灌我了，這個夜明珠給你！”喝下這兩缸酒的%s掏出個一級煉星石說道。",
		"“我要你喝我要你喝！”大醉的%s在地上瘋狂打滾，你只好喝下一缸。",
		
	},
}

WineGameConfig:addConfig
{
	status_encode = 25,
	desc = 
	{
		"“這下酒菜不錯！”喝下這一缸的%s開始吃馬草。",
		"“這下酒菜不錯！”吃著馬草的%s看你喝下一缸酒。",
		"“今天拼酒拼不贏，名將五連黃月英！”%s已然大醉，卻仍和你乾了一缸。",
		"“再灌我！我爹可是曹操！”喝了這倆缸，%s似乎扛不住了。",
		"“再灌我！我爹可是曹操！”%s突然暴怒，你只好喝下一缸讓他消消氣。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 26,
	desc = 
	{
		"你往%s嘴裡猛灌十幾缸酒，他倒在了地上。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 31,
	desc = 
	{
		"“我比王城車夫高的多！”%s沒管胡言亂語的你，自己喝下了一缸。",
		"“我比王城車夫高的多！”喝了這缸酒，你已經開始胡言亂語。",
		"“這缸好酒不乾爽，抽卡只出鮑三娘！”又幹一缸，你似乎已經有點不支。",
		"“我比王城車夫。。。唔“%s還沒說完，就被你灌了兩缸酒。",
		"“我還沒醉！”憤怒的%s一把奪過酒灌到了你嘴裡。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 32,
	desc = 
	{
		"“酒逢知己千杯少，能喝多少喝多少！”%s又喝了一缸。",
		"“酒逢知己千杯少，能喝多少喝多少！”你又喝了一缸。",
		"“酒逢知己千杯少，能喝多少喝多少！幹！”酒過三巡，你和%s漸入佳境。",
		"“我有一百種方法灌醉你，可你，卻無可奈何。”你成功灌了%s兩缸酒。",
		"“我有一百種方法灌。。。”“啪！”你還沒說完，被%s扇了一耳光，順帶灌了一缸酒。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 33,
	desc = 
	{
		"“只要感情好，能喝多少喝多少！”%s又下肚一缸。",
		"“只要感情好，能喝多少喝多少！”你又下肚一缸。",
		"“乾了這缸豪傑酒，黑市曹操天天有！”你和%s的酒量似乎還未見底。",
		"“我愛黃月英！”被你灌了兩缸酒的%s開始大喊大叫。",
		"“我愛六龍御天！”%s突然有了力量，奮起反抗，灌了你一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 34,
	desc = 
	{
		"“這種狗我家後院栓了十幾隻。”%s喝下一缸酒，開始胡言亂語。",
		"“這種狗我家後院栓了十幾隻。”你喝下一缸酒，開始胡言亂語。",
		"“東風吹，戰鼓擂，今天喝酒誰怕誰！”滿身酒氣的%s好像很有氣勢，和你又乾了一缸。",
		"只見你在%s準備開口說話的瞬間，把兩缸豪傑酒灌到了他嘴裡。",
		"你剛剛抬起酒缸，%s就一招奔雷手把酒全部推到你嘴裡。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 35,
	desc = 
	{
		"“這書法剛柔相濟，行雲流水，少見的佳作啊！”喝高的%s向你介紹手中的無字天書。",
		"“這書法剛柔相濟，行雲流水，少見的佳作啊！”%s喝高了，向你介紹手中的無字天書。",
		"“感情鐵，喝出血！”醉酒的%s非常豪氣，和你又乾了一缸。",
		"你強行按住醉酒的%s，往他嘴裡狠狠灌了兩缸酒。",
		"你剛想按住醉酒的%s，怎料他一個鯉魚打挺，反把你按倒灌了一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 36,
	desc = 
	{
		"%s被你灌得不省人事，躺在地上口吐白沫。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 41,
	desc = 
	{
		"“五魁首啊六六六！喝！”%s運氣不佳，喝下一缸。",
		"“五魁首啊六六六！喝！”快支援不住的你喝下一缸。",
		"“想要感情有，就得多喝酒！”你非常亢奮地和%s又乾了一缸。",
		"“其實我是六龍的策劃隔壁老王。。。唔”%s還沒說完又被你灌了幾缸。",
		"“我不喝我不喝！”%s頑強抵抗，你只好自罰一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 42,
	desc = 
	{
		"“哥倆好啊三星照！喝！”%s輕鬆喝下一缸。",
		"“哥倆好啊三星照！喝！”你艱難地又喝一缸。",
		"“今天拼酒拼不贏，名將五連黃月英！”乾了這缸的你已然大醉，卻仍在苦苦支撐。",
		"原本大醉的你突然出擊，往%s的嘴裡猛灌兩缸酒。",
		"“我不敢了！這個夜明珠給你！”反被灌一缸酒的你掏出個一級煉星石說道。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 43,
	desc = 
	{
		"“這種狗我家後院栓了十幾隻。”%s喝下一缸酒，開始胡言亂語。",
		"“這種狗我家後院栓了十幾隻。”你喝下一缸酒，開始胡言亂語。",
		"“東風吹，戰鼓擂，今天喝酒誰怕誰！”滿身酒氣的你好像很有氣勢，和%s又乾了一缸。",
		"只見你在%s準備開口說話的瞬間，把兩缸豪傑酒灌到了他嘴裡。",
		"你剛剛抬起酒缸，%s就一招奔雷手把酒全部推到你嘴裡。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 44,
	desc = 
	{
		"“八匹馬啊七個巧！喝！”%s喝下一缸。",
		"“八匹馬啊七個巧！喝！”你喝下一缸。",
		"你和%s一飲而盡，桌上又多了倆空缸。",
		"你強行掰開%s的嘴，往裡倒了兩缸。",
		"%s反手一個鎖喉，把酒搶過來倒你嘴裡。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 45,
	desc = 
	{
		"“喝！喝！喝！”也不知道是誰輸了，反正%s喝了一缸。",
		"“喝！喝！喝！”也不知道是誰輸了，反正你喝了一缸。",
		"“人在江湖飄，哪能不喝高！”爛醉的%s和你又幹一缸。",
		"被灌兩缸的%s一下吐在旁邊哥們的時裝上，被暴揍一頓。",
		"“我沒醉！我沒醉！”%s搖晃著手裡的開山刀大喊大叫，你只好自己喝了一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 46,
	desc = 
	{
		"你扶著牆離開了酒桌，留下手舞足蹈的%s發酒瘋。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 51,
	desc = 
	{
		"看著爛醉如泥的你，%s自顧喝下了一缸。",
		"“我們那個狗皇帝就知道禁言！”再喝一缸的你已經爛醉如泥了。",
		"“我們那個狗皇帝就知道禁言！”乾了這一缸，你已經爛醉如泥了。",
		"爛醉的你突然出擊，%s措手不及被灌了兩缸。",
		"“這麼醉酒別灌啦兄弟！”%s果斷反擊，灌了你一缸",
	},
}

WineGameConfig:addConfig
{
	status_encode = 52,
	desc = 
	{
		"“這下酒菜不錯！”你吃著馬草，看著%s喝下一缸。",
		"“這下酒菜不錯！”大醉的你喝了一缸，開始吃馬草。",
		"“今天拼酒拼不贏，名將五連黃月英！”你已然大醉，卻仍和%s乾了一缸。",
		"“再灌我！我爹可是曹操！”喝了這倆缸，%s似乎扛不住了。",
		"“大爺對不起！”說對不起也來不及了，你又被灌一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 53,
	desc = 
	{
		"“這書法剛柔相濟，行雲流水，少見的佳作啊！”喝高的%s向你介紹手中的無字天書。",
		"“這書法剛柔相濟，行雲流水，少見的佳作啊！”%s喝高了，向你介紹手中的無字天書。",
		"“感情鐵，喝出血！”醉酒的你非常豪氣，和%s又乾了一缸。",
		"醉酒的你強行按住%s，往他嘴裡狠狠灌了兩缸酒。",
		"你剛想按住%s，怎料他依然清醒，反把你按倒灌了一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 54,
	desc = 
	{
		"“喝！喝！喝！”也不知道是誰輸了，反正%s喝了一缸。",
		"“喝！喝！喝！”也不知道是誰輸了，反正你喝了一缸。",
		"“人在江湖飄，哪能不喝高！”爛醉的你和%s又幹一缸。",
		"被灌兩缸的%s一下吐在旁邊哥們的時裝上，被暴揍一頓。",
		"“我沒醉！我沒醉！”%s搖晃著手裡的開山刀大喊大叫，你只好自己喝了一缸。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 55,
	desc = 
	{
		"“你輸了！”爛醉的%s趴在地上又喝一缸。",
		"“你輸了！”爛醉的你趴在地上又喝一缸。",
		"乾了這缸酒，你和%s已經快神志不清了。",
		"你用盡自己的最後一點力，把兩缸酒灌到了%s嘴裡。",
		"%s用盡自己最後一點力，把一缸酒推到了你嘴裡。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 56,
	desc = 
	{
		"你搖搖晃晃離開酒桌，留下大醉的%s啃桌子。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 61,
	desc = 
	{
		"%s輕鬆灌倒了你，攜財寶揚長而去。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 62,
	desc = 
	{
		"%s往你嘴裡猛灌十幾缸酒，你倒在了地上。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 63,
	desc = 
	{
		"你被%s灌得不省人事，躺在地上口吐白沫。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 64,
	desc = 
	{
		"%s扶著牆離開了酒桌，留下手舞足蹈的你發酒瘋。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 65,
	desc = 
	{
		"%s搖搖晃晃離開酒桌，留下大醉的你啃桌子。",
	},
}

WineGameConfig:addConfig
{
	status_encode = 66,
	desc = 
	{
		"%s和你喝完最後一缸，同時砸到在了酒桌上。",
	},
}
return WineGameConfig
